collection/olddays/org/learnSV/learnSV.org
#+TITLE: learnSV
#+DATE: <2016-08-31 周三>
#+AUTHOR:
#+EMAIL: LME_zhangz@LME_ZHANGZ-PC
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:nil p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:t todo:t |:t
#+CREATOR: Emacs 24.5.1 (Org mode 8.2.10)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

* SystemVerilog验证

** Part 1
*** Chp1 验证导论

**** 1.1 验证流程
- 硬件设计，创建一个基于设计规范并能完成特定任务的设备。
- 验证设计，确保该设备能够正确地完成预定的任务。

***** 1.1.1 不同层次上的测试
- 代码块(block)，模块(module)内部。
- 代码块边界，速度快。
- 多个代码块，可以相互激励，工作负担较少；需要在代码和测试平台中同时查找漏洞。
- 最高层次，整个系统都被测试，仿真过程会简单。
  - 需要更精细的测试，让待测设计尽可能多的代码块被激活。
- 出现错误时的待测模块的处理。

***** 1.1.2 验证计划
- 需要验证什么样的特性
- 采用哪些技术
包括
+ 定向或随机的测试
+ 断言
+ 软硬件协同验证
+ 硬件仿真
+ 形式验证
+ 对验证IP的使用

**** 1.2 验证方法学
VMM 有一套针对数据和环境的基本类，有多种功能。

**** 1.3 基本测试平台的功能
1. 产生激励(sequence item)
2. 把激励加到DUT上(driver)
3. 捕捉响应(monitor)
4. 检验正确性(scoreboard)
5. 对照整个验证目标测算进展情况(coverage)

**** 1.4 定向测试
- 渐进式的方法。
- 稳步前进，设计复杂会翻倍消耗时间。

**** 1.5 方法学基础
- 原则
  1. 受约束的随机激励
  2. 功能覆盖率
  3. 使用事务处理器的分层测试平台
  4. 对所有的测试通用的测试平台
  5. 独立于测试平台之外的个性化测试代码
- 分层的测试平台将复杂的问题分解为容易处理的小块，降低复杂度
- 通过”钩子“，调整激励或注入错误等操作
- 针对单一测试的个性化代码必须与测试平台分开
- 每个随机测试都包含一部分代码，同过不同的激励约束，得到正确或者错误的激励
- 最后的漏洞可能只能通过定向测试来发现

**** 1.6 受约束的随机激励
- 希望随机，又不希望完全随机
- 约束比定向范围大
- 约束可能重叠
- 约束可能不合法，此事需调整约束
- 约束不到的，可能需要定向测试
- 通过检测功能覆盖率，循环迭代以完成测试

**** 1.7 随机化的对象
1. 设备的配置
2. 环境配置
3. 输入数据
4. 协议异常
5. 错误和违例
6. 时延

***** 1.7.1 设备和环境配置
- 设备的配置指设备自身的设置
- 环境的配置指设备的外围所被包围的其他部件
  - 如周围部件的个数、种类等
  - 还包含测试长度，错误注入比率，以及时延模式

***** 1.7.2 输入数据
- 第5章和第8章，认真准备事务类
- 估计所有的分层协议和错误注入，以及记分板的内容和功能覆盖率

***** 1.7.3 协议异常、错误和违例
- 非法操作，信号冲突。
- 通过断言定位错误的位置，可以提高查错效率

***** 1.7.4 时延和同步
- 单输入时，输入间的时延可能隐藏了漏洞
- 多输入时，不同输入口的速度差可能存在漏洞

***** 1.7.5 并行的随机测试
- 通过不同的种子，进行并行测试
- 使用各种方法改变测试的种子

**** 1.8 功能覆盖率
通过功能覆盖率，确认验证的进展。
- 需要在测试平台中加入监控激励，以及设备对激励的反应，并据此确定功能验证的进展。
- 收集仿真结果，进行分析，确定下一步的测试激励。

***** 1.8.1 从功能覆盖率到激励的反馈
- 通过功能覆盖率的统计结果，自动控制新激励的生成，减少人工干预。
- 难度大，需要丰富的经验，较少使用。

**** 1.9 测试平台的构件
- 产生激励并捕捉响应
- 工作在一个个抽象层次范围
- 创建事务和激励序列并最终转换成比特向量
- 平台模块：包含多种bfm（如果需要fpga仿真，则需要验证组件也是课综合的）

**** 1.10 分层的测试平台
让平台变得易于维护，减轻工作量。

***** 1.10.1 不分层的测试平台
- 把通用的操作放到一个子程序中，可以提高效率，减少出错。
- 物理和命令层的建立，是分层的第一步。

***** 1.10.2 信号和命令层
- 信号层，包含待测设计和把待测设计连接到平台的信号（DUT,interface）
- 命令层，驱动器、监视器和断言（driver,monitor,assertion）

***** 1.10.3 功能层
- 代理，记分板，检验器(agent,scoreboard,checker)
- 事务(transaction)

***** 1.10.4 场景层
- 组织随机的事务(sequence)
- 在测试平台中，当以上的行为发生变化时，通过工厂模式和回调函数来创建。

***** 1.10.5 测试的层次和功能覆盖率
- 测试包含了用于创建激励的约束。
- 功能覆盖率可以衡量所有测试在满足验证计划要求方面的进展。
- 在测试中创建“定向测试”，搭配随机测试作为“背景噪声”（信号间隔、事务信号间隔），将漏洞暴露出来。
- 除了“测试”，其他构建可以根据需要选择部分实现。
- 可能需要更多层构件，来实现。

**** 1.11 建立一个分层的测试平台
***** 1.11.1 创建简单的驱动器
- 驱动器可能会注入错误或者增加实验，然后把命令分解层一些信号的变化。
- 核心为一个循环
简单例子：
1. 获取一个事务
2. 进行变换
3. 发送事务
实际中：
- 另一个实例是agent，将复杂的事务分割成多个总线命令。(Chp5)
- 使用信箱实现对象在不同事务处理器之间传递。(Chp5)
- 不同层之间交换数据并使事务处理器实现同步。(Chp7)

**** 1.12 仿真环境阶段
基本的阶段是建立(build)，运行(run)和收尾(wrap-up)。
建立阶段
1. 生成配置：把待测设计的配置和周围环境随机化
2. 建立环境：基于配置来分配和连接测试平台的构件（外围的仿真构件，并非待测设计本身）
3. 对待测设计进行复位
4. 配置待测设计：基于第一步中生成的配置，载入待测设计的命令寄存器
运行阶段
1. 启动环境：裕兴测试平台的构件
2. 运行测试：启动测试然后等待测试完成。由上而下的等待，每层空闲；同时设置超时检测。
收尾节点
1. 清空：在最下层完成以后，等待待测设计清空最后的事务。
2. 报告：从记分板中创建报告，测试失败的数据需要抛弃。

**** 1.13 最大限度的代码重用
可以重用的代码价值巨大，时刻思考重用。
可以重用的代码价值巨大，时刻思考重用。
可以重用的代码价值巨大，时刻思考重用。

**** 1.14 测试平台的性能
创建受约束的随机测试需要几个步骤
- 建立分层的测试平台，包括自检部分
- 按照验证计划中列举的目标创建激励
- 功能覆盖率
- 收集数据
- 分析数据

**** 1.15 结束语
System Verilog 就是拧

**** 总结



*** Chp2 数据类型
优点：
1. 双状态数据类型
2. 队列、动态和关联数组
3. 类和结构
4. 联合和合并结构
5. 字符串
6. 枚举类型

**** 2.1 内建数据类型
Verilog 的变量都是静态的，存活在整个仿真过程。子程序不能通过堆栈来保存形参和局部变量。

***** 2.1.1 逻辑(logic)类型
- 具有reg的所有功能，以及wire的部分功能。
- 不能有多驱动，多驱动只能使用wire。

***** 2.1.2 双状态数据类型
| name         | detail                   |
|--------------+--------------------------|
| bit          | 双状态，单比特           |
| bit [31:0]   | 双状态，32比特无符号整型 |
| int unsigned | 双状态，32比特无符号整型 |
| int          | 双状态，32比特有符号     |
| byte         | 双状态，8比特有符号      |
| shortint     | 双状态，16比特有符号     |
| longint      | 双状态，64比特有符号     |
| integer      | 四状态，32比特有符号     |
| time         | 四状态，64比特无符号整数 |
| real         | 双状态，双精度浮点数     |
- 随机化时带符号的变量可能造成意想不到的结果。
- 新类型都是有符号数。用无符号数时，建议用bit。
- 检查四状态数值: $isunknown(), 如果出现X或Z时返回1。

**** 2.2 定宽数组

***** 2.2.1 定宽数组的声明和初始化
- SystemVerilog 允许只给出数组宽度的便捷声明方式
- 多维数组允许紧凑型的声明
- 越界的地址，四状态返回X，双状态返回0。定宽数组、动态数组、关联数组和队列同样适应。
- 非合并数组将数组元素存放在32比特的字边界。
- logic和integer通常使用多一倍的空间。
示例
#+BEGIN_SRC verilog
int array2[0:7][0:3];  //完整声明，应当注意下表的顺序。
int array3[8][4];  //紧凑声明
#+END_SRC

***** 2.2.2 常量数据
一个单引号加大括号来初始化数组。
#+BEGIN_SRC verilog
int ascend[4] = '{0,1,2,3};
int descend[5];
descend = '{4,3,2,1,0};
descend[0:2] = '{5,6,7};
ascend = '{4{8}};
descend = '{0:9,1:8,default:1};
#+END_SRC

***** 2.2.3 基本的数据操作-for和foreach
for (Internet i = 0; i<$size(src);i++)  //$size返回数组的宽度。
foreach(dst[j])
- 只需指定数组名并在其后面的方括号中给出索引变量，
- 索引变量将自动声明，并只在循环中有效。
foreach(md[i,j])
- 多维数据的索引变量用法比较特别。
#+BEGIN_SRC verilog
int md[2][3]='{'{0,1,2},'{3,4,5}}
#+END_SRC

- 多维数组赋值。
foreach(md[,j]) $write("%d",md[i][j]);
- 只遍历其中某一个维度。

***** 2.2.4 基本的数组操作--复制和比较
- 必须为类型完全一样的数组才可以进行复制和比较。
- 可以用于数组片段比较，必须保证片段类型完全一样。

***** 2.2.5 同时使用位下标和数组下标

***** 2.2.6 合并数组
存储时为连续的比特集合，中间没有任何限制的空间。

***** 2.2.7 合并数组的例子
- 合并的位和数组的大小作为数据类型的一部分必须在变量名前面；
- 数组大小定义的格式必须是[msb:lsb]，不可以使[size];
- 可以扩展为更多维的合并数组；
- 引用时，下标顺序从左到右对应声明时的顺序；
- 合并数组的本质是，连续的比特
例子
#+BEGIN_SRC verilog
 bit [3:0][7:0] bytes;
#+END_SRC


合并数组和非合并数组可以混合使用。
#+BEGIN_SRC verilog
 bit [3:0][7:0] barray[3];
 bit [31:0] one_word = 32'h0123_4567;
 barray[0] = one_word;
#+END_SRC

合并数组的本质只是将简单变量的位宽用数组的形式表达。
混合了非合并数组的合并数组，使用时必须至少带有一个下标。
合并数组实现复制时，因为其本质为比特，所以只需要保证长度相等即可，维度可以不同。

***** 2.2.8 合并数组和和非合并数组的选择
- 当需要和标量进行相互转换时，使用合并数组会非常方便。
- 任何数组类型都可以合并。
- 如果需要等待数组中的变化，则必须使用合并数组
  - @：只能用于标量或者合并数组；
  - 不能使用barray，只能使用:
    #+BEGIN_SRC verilog
      @(barray[0] or barray[1] or barray[2]);
    #+END_SRC

