collection/olddays/org/learnSV/learnSV.tex
% Created 2017-10-19 周四 22:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\textit{<2016-08-31 周三>}}
\title{learnSV}
\hypersetup{
 pdfauthor={},
 pdftitle={learnSV},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section*{SystemVerilog验证}
\label{sec:orgdf5afad}

\subsection*{Part 1}
\label{sec:org9d3b055}
\subsubsection*{Chp1 验证导论}
\label{sec:orgaa0ff8e}

\begin{itemize}
\item 1.1 验证流程
\label{sec:org1e4a03f}
\begin{itemize}
\item 硬件设计，创建一个基于设计规范并能完成特定任务的设备。
\item 验证设计，确保该设备能够正确地完成预定的任务。
\end{itemize}

\begin{itemize}
\item 1.1.1 不同层次上的测试
\label{sec:org608c0e6}
\begin{itemize}
\item 代码块(block)，模块(module)内部。
\item 代码块边界，速度快。
\item 多个代码块，可以相互激励，工作负担较少；需要在代码和测试平台中同时查找漏洞。
\item 最高层次，整个系统都被测试，仿真过程会简单。
\begin{itemize}
\item 需要更精细的测试，让待测设计尽可能多的代码块被激活。
\end{itemize}
\item 出现错误时的待测模块的处理。
\end{itemize}

\item 1.1.2 验证计划
\label{sec:org16d86e1}
\begin{itemize}
\item 需要验证什么样的特性
\item 采用哪些技术
\end{itemize}
包括
\begin{itemize}
\item 定向或随机的测试
\item 断言
\item 软硬件协同验证
\item 硬件仿真
\item 形式验证
\item 对验证IP的使用
\end{itemize}
\end{itemize}

\item 1.2 验证方法学
\label{sec:org4194c3c}
VMM 有一套针对数据和环境的基本类，有多种功能。

\item 1.3 基本测试平台的功能
\label{sec:orgfa545a9}
\begin{enumerate}
\item 产生激励(sequence item)
\item 把激励加到DUT上(driver)
\item 捕捉响应(monitor)
\item 检验正确性(scoreboard)
\item 对照整个验证目标测算进展情况(coverage)
\end{enumerate}

\item 1.4 定向测试
\label{sec:orgbad059b}
\begin{itemize}
\item 渐进式的方法。
\item 稳步前进，设计复杂会翻倍消耗时间。
\end{itemize}

\item 1.5 方法学基础
\label{sec:org4ecd2a4}
\begin{itemize}
\item 原则
\begin{enumerate}
\item 受约束的随机激励
\item 功能覆盖率
\item 使用事务处理器的分层测试平台
\item 对所有的测试通用的测试平台
\item 独立于测试平台之外的个性化测试代码
\end{enumerate}
\item 分层的测试平台将复杂的问题分解为容易处理的小块，降低复杂度
\item 通过”钩子“，调整激励或注入错误等操作
\item 针对单一测试的个性化代码必须与测试平台分开
\item 每个随机测试都包含一部分代码，同过不同的激励约束，得到正确或者错误的激励
\item 最后的漏洞可能只能通过定向测试来发现
\end{itemize}

\item 1.6 受约束的随机激励
\label{sec:org73fed27}
\begin{itemize}
\item 希望随机，又不希望完全随机
\item 约束比定向范围大
\item 约束可能重叠
\item 约束可能不合法，此事需调整约束
\item 约束不到的，可能需要定向测试
\item 通过检测功能覆盖率，循环迭代以完成测试
\end{itemize}

\item 1.7 随机化的对象
\label{sec:org5c7a129}
\begin{enumerate}
\item 设备的配置
\item 环境配置
\item 输入数据
\item 协议异常
\item 错误和违例
\item 时延
\end{enumerate}

\begin{itemize}
\item 1.7.1 设备和环境配置
\label{sec:orgaf359e2}
\begin{itemize}
\item 设备的配置指设备自身的设置
\item 环境的配置指设备的外围所被包围的其他部件
\begin{itemize}
\item 如周围部件的个数、种类等
\item 还包含测试长度，错误注入比率，以及时延模式
\end{itemize}
\end{itemize}

\item 1.7.2 输入数据
\label{sec:org5755b7a}
\begin{itemize}
\item 第5章和第8章，认真准备事务类
\item 估计所有的分层协议和错误注入，以及记分板的内容和功能覆盖率
\end{itemize}

\item 1.7.3 协议异常、错误和违例
\label{sec:org43528e9}
\begin{itemize}
\item 非法操作，信号冲突。
\item 通过断言定位错误的位置，可以提高查错效率
\end{itemize}

\item 1.7.4 时延和同步
\label{sec:org68792ec}
\begin{itemize}
\item 单输入时，输入间的时延可能隐藏了漏洞
\item 多输入时，不同输入口的速度差可能存在漏洞
\end{itemize}

\item 1.7.5 并行的随机测试
\label{sec:orga846924}
\begin{itemize}
\item 通过不同的种子，进行并行测试
\item 使用各种方法改变测试的种子
\end{itemize}
\end{itemize}

\item 1.8 功能覆盖率
\label{sec:org3b97189}
通过功能覆盖率，确认验证的进展。
\begin{itemize}
\item 需要在测试平台中加入监控激励，以及设备对激励的反应，并据此确定功能验证的进展。
\item 收集仿真结果，进行分析，确定下一步的测试激励。
\end{itemize}

\begin{itemize}
\item 1.8.1 从功能覆盖率到激励的反馈
\label{sec:org98db8cc}
\begin{itemize}
\item 通过功能覆盖率的统计结果，自动控制新激励的生成，减少人工干预。
\item 难度大，需要丰富的经验，较少使用。
\end{itemize}
\end{itemize}

\item 1.9 测试平台的构件
\label{sec:org0261064}
\begin{itemize}
\item 产生激励并捕捉响应
\item 工作在一个个抽象层次范围
\item 创建事务和激励序列并最终转换成比特向量
\item 平台模块：包含多种bfm（如果需要fpga仿真，则需要验证组件也是课综合的）
\end{itemize}

\item 1.10 分层的测试平台
\label{sec:org98077c5}
让平台变得易于维护，减轻工作量。

\begin{itemize}
\item 1.10.1 不分层的测试平台
\label{sec:org85cd4be}
\begin{itemize}
\item 把通用的操作放到一个子程序中，可以提高效率，减少出错。
\item 物理和命令层的建立，是分层的第一步。
\end{itemize}

\item 1.10.2 信号和命令层
\label{sec:orgd59b38f}
\begin{itemize}
\item 信号层，包含待测设计和把待测设计连接到平台的信号（DUT,interface）
\item 命令层，驱动器、监视器和断言（driver,monitor,assertion）
\end{itemize}

\item 1.10.3 功能层
\label{sec:org22a7d58}
\begin{itemize}
\item 代理，记分板，检验器(agent,scoreboard,checker)
\item 事务(transaction)
\end{itemize}

\item 1.10.4 场景层
\label{sec:org87c0fa0}
\begin{itemize}
\item 组织随机的事务(sequence)
\item 在测试平台中，当以上的行为发生变化时，通过工厂模式和回调函数来创建。
\end{itemize}

\item 1.10.5 测试的层次和功能覆盖率
\label{sec:org9ce0b73}
\begin{itemize}
\item 测试包含了用于创建激励的约束。
\item 功能覆盖率可以衡量所有测试在满足验证计划要求方面的进展。
\item 在测试中创建“定向测试”，搭配随机测试作为“背景噪声”（信号间隔、事务信号间隔），将漏洞暴露出来。
\item 除了“测试”，其他构建可以根据需要选择部分实现。
\item 可能需要更多层构件，来实现。
\end{itemize}
\end{itemize}

\item 1.11 建立一个分层的测试平台
\label{sec:org41aeb8f}
\begin{itemize}
\item 1.11.1 创建简单的驱动器
\label{sec:org25c68aa}
\begin{itemize}
\item 驱动器可能会注入错误或者增加实验，然后把命令分解层一些信号的变化。
\item 核心为一个循环
\end{itemize}
简单例子：
\begin{enumerate}
\item 获取一个事务
\item 进行变换
\item 发送事务
\end{enumerate}
实际中：
\begin{itemize}
\item 另一个实例是agent，将复杂的事务分割成多个总线命令。(Chp5)
\item 使用信箱实现对象在不同事务处理器之间传递。(Chp5)
\item 不同层之间交换数据并使事务处理器实现同步。(Chp7)
\end{itemize}
\end{itemize}

\item 1.12 仿真环境阶段
\label{sec:org0ddc819}
基本的阶段是建立(build)，运行(run)和收尾(wrap-up)。
建立阶段
\begin{enumerate}
\item 生成配置：把待测设计的配置和周围环境随机化
\item 建立环境：基于配置来分配和连接测试平台的构件（外围的仿真构件，并非待测设计本身）
\item 对待测设计进行复位
\item 配置待测设计：基于第一步中生成的配置，载入待测设计的命令寄存器
\end{enumerate}
运行阶段
\begin{enumerate}
\item 启动环境：裕兴测试平台的构件
\item 运行测试：启动测试然后等待测试完成。由上而下的等待，每层空闲；同时设置超时检测。
\end{enumerate}
收尾节点
\begin{enumerate}
\item 清空：在最下层完成以后，等待待测设计清空最后的事务。
\item 报告：从记分板中创建报告，测试失败的数据需要抛弃。
\end{enumerate}

\item 1.13 最大限度的代码重用
\label{sec:orgf261640}
可以重用的代码价值巨大，时刻思考重用。
可以重用的代码价值巨大，时刻思考重用。
可以重用的代码价值巨大，时刻思考重用。

\item 1.14 测试平台的性能
\label{sec:org4293d99}
创建受约束的随机测试需要几个步骤
\begin{itemize}
\item 建立分层的测试平台，包括自检部分
\item 按照验证计划中列举的目标创建激励
\item 功能覆盖率
\item 收集数据
\item 分析数据
\end{itemize}

\item 1.15 结束语
\label{sec:orga94c591}
System Verilog 就是拧

\item 总结
\label{sec:org11d3862}
\end{itemize}



\subsubsection*{Chp2 数据类型}
\label{sec:org586be4b}
优点：
\begin{enumerate}
\item 双状态数据类型
\item 队列、动态和关联数组
\item 类和结构
\item 联合和合并结构
\item 字符串
\item 枚举类型
\end{enumerate}

\begin{itemize}
\item 2.1 内建数据类型
\label{sec:orgebbd007}
Verilog 的变量都是静态的，存活在整个仿真过程。子程序不能通过堆栈来保存形参和局部变量。

\begin{itemize}
\item 2.1.1 逻辑(logic)类型
\label{sec:org52d8b69}
\begin{itemize}
\item 具有reg的所有功能，以及wire的部分功能。
\item 不能有多驱动，多驱动只能使用wire。
\end{itemize}

\item 2.1.2 双状态数据类型
\label{sec:org9c2d354}
\begin{center}
\begin{tabular}{ll}
name & detail\\
\hline
bit & 双状态，单比特\\
bit [31:0] & 双状态，32比特无符号整型\\
int unsigned & 双状态，32比特无符号整型\\
int & 双状态，32比特有符号\\
byte & 双状态，8比特有符号\\
shortint & 双状态，16比特有符号\\
longint & 双状态，64比特有符号\\
integer & 四状态，32比特有符号\\
time & 四状态，64比特无符号整数\\
real & 双状态，双精度浮点数\\
\end{tabular}
\end{center}
\begin{itemize}
\item 随机化时带符号的变量可能造成意想不到的结果。
\item 新类型都是有符号数。用无符号数时，建议用bit。
\item 检查四状态数值: \$isunknown(), 如果出现X或Z时返回1。
\end{itemize}
\end{itemize}

\item 2.2 定宽数组
\label{sec:org75faa56}

\begin{itemize}
\item 2.2.1 定宽数组的声明和初始化
\label{sec:org99fcb95}
\begin{itemize}
\item SystemVerilog 允许只给出数组宽度的便捷声明方式
\item 多维数组允许紧凑型的声明
\item 越界的地址，四状态返回X，双状态返回0。定宽数组、动态数组、关联数组和队列同样适应。
\item 非合并数组将数组元素存放在32比特的字边界。
\item logic和integer通常使用多一倍的空间。
\end{itemize}
示例
\begin{verbatim}
int array2[0:7][0:3];  //完整声明，应当注意下表的顺序。
int array3[8][4];  //紧凑声明
\end{verbatim}

\item 2.2.2 常量数据
\label{sec:orga16bed6}
一个单引号加大括号来初始化数组。
\begin{verbatim}
int ascend[4] = '{0,1,2,3};
int descend[5];
descend = '{4,3,2,1,0};
descend[0:2] = '{5,6,7};
ascend = '{4{8}};
descend = '{0:9,1:8,default:1};
\end{verbatim}

\item 2.2.3 基本的数据操作-for和foreach
\label{sec:orgb05100c}
for (Internet i = 0; i<\$size(src);i++)  //\$size返回数组的宽度。
foreach(dst[j])
\begin{itemize}
\item 只需指定数组名并在其后面的方括号中给出索引变量，
\item 索引变量将自动声明，并只在循环中有效。
\end{itemize}
foreach(md[i,j])
\begin{itemize}
\item 多维数据的索引变量用法比较特别。
\end{itemize}
\begin{verbatim}
int md[2][3]='{'{0,1,2},'{3,4,5}}
\end{verbatim}

\begin{itemize}
\item 多维数组赋值。
\end{itemize}
foreach(md[,j]) \$write("\%d",md[i][j]);
\begin{itemize}
\item 只遍历其中某一个维度。
\end{itemize}

\item 2.2.4 基本的数组操作--复制和比较
\label{sec:org9992c6a}
\begin{itemize}
\item 必须为类型完全一样的数组才可以进行复制和比较。
\item 可以用于数组片段比较，必须保证片段类型完全一样。
\end{itemize}

\item 2.2.5 同时使用位下标和数组下标
\label{sec:org098481c}

\item 2.2.6 合并数组
\label{sec:org5964e45}
存储时为连续的比特集合，中间没有任何限制的空间。

\item 2.2.7 合并数组的例子
\label{sec:org301014a}
\begin{itemize}
\item 合并的位和数组的大小作为数据类型的一部分必须在变量名前面；
\item 数组大小定义的格式必须是[msb:lsb]，不可以使[size];
\item 可以扩展为更多维的合并数组；
\item 引用时，下标顺序从左到右对应声明时的顺序；
\item 合并数组的本质是，连续的比特
\end{itemize}
例子
\begin{verbatim}
bit [3:0][7:0] bytes;
\end{verbatim}


合并数组和非合并数组可以混合使用。
\begin{verbatim}
bit [3:0][7:0] barray[3];
bit [31:0] one_word = 32'h0123_4567;
barray[0] = one_word;
\end{verbatim}

合并数组的本质只是将简单变量的位宽用数组的形式表达。
混合了非合并数组的合并数组，使用时必须至少带有一个下标。
合并数组实现复制时，因为其本质为比特，所以只需要保证长度相等即可，维度可以不同。

\item 2.2.8 合并数组和和非合并数组的选择
\label{sec:org9ab515b}
\begin{itemize}
\item 当需要和标量进行相互转换时，使用合并数组会非常方便。
\item 任何数组类型都可以合并。
\item 如果需要等待数组中的变化，则必须使用合并数组
\begin{itemize}
\item @：只能用于标量或者合并数组；
\item 不能使用barray，只能使用:
\begin{verbatim}
@(barray[0] or barray[1] or barray[2]);
\end{verbatim}
\end{itemize}
\end{itemize}
\end{itemize}

\item 2.3 动态数组
\label{sec:orgec0dfd7}

\begin{itemize}
