collection/olddays/org/learnSV/learnSV.org
**** 2.3 动态数组

- 编译时不指定宽度，运行时分配空间。
#+BEGIN_SRC verilog
 int dyn[],dyn2[];
 initial dyn = new[5];
 dyn2 = new[4]; // dyn2 = new[10];
 dyn = new[5](dyn2);
 dyn.delete();
#+END_SRC
- 动态数组位宽函数 dyn.size，$size(dyn)
- 动态数组可以不用new函数，直接初始化。此时位宽将会定下来。
- 只要基本数据类型相同，定宽数组和动态数组间的元素可以相互赋值
- 在元素数目相同的情况下，可以把动态数组的值复制给定宽数组。

**** 2.4 队列
- 结合链表和数组的优点。
- 可以在队列的任何地方增删元素。性能比动态数组高（动态数组需要新建数组再复制）。
- 可以通过索引实现对任一元素的访问，不需要像链表那样去遍历目标元素前的所有元素。
例子
元素增删
#+BEGIN_SRC verilog
 int q[$] ={0,2,4};  // 元素编号从左向右升序排列，0开始。队列赋值不需要 '{} 。
 q.insert(1,j); // 在2前插入j。
 q.insert(1,q2); // 在j前插入队列q2。
 q.delete(1);  // 删除第1个元素
 q.push_front(6); // 在队列前面插入6
 q.push_back(6);  // 在队列后面插入6
 j = q.pop_front; // 弹出队列前面的元素并赋值给j
 j = q.pop_back; // 弹出队列后面的元素并赋值给j
 q.delete();  // 删除队列
#+END_SRC
范围表达
 [$:2]  [5:$] $在左表示最小边界，在右代表最大边界。
#+BEGIN_SRC verilog
 q = {q[0],j,q[1:$]}
 q = {q[0:2], q2, q[3:$]}
 q = {q[0],q[2:$]}
#+END_SRC

元素增删的等效方法
#+BEGIN_SRC verilog
 q = {6，q}
 j = q[$] // 最右边的值
 q = q[0:$-1]
 q = {q,8}
 j = q[0]
 q = q[1:$]
#+END_SRC
对队列前后元素的操作是速度非常快的，操作队列中间的元素则与队列长度有关。
可以把定宽或者动态数组的值赋给队列。

**** 2.5 关联数组

- 使用关联数组类型，保存稀疏矩阵的元素。SV 只为实际写入值的元素分配空间。
- 仿真器可以使用树或者哈希表的形式来存放关联数组。
- 声明：在方括号中放置数据类型的形式作为索引的数据包，（可以使用‘*’，不推荐）
- 例：
#+BEGIN_SRC verilog
   bit [63:0]  assoc[bit[63:0]],idx=1;
   assoc[idx] = idx;
   foreach(assoc[i]) $display("assoc[%h]=%h",assoc[i]);  //只打印有索引的内容。
   assoc.first(idx); // 找到第一个元素，并将其索引值赋给idx，如果失败返回0，成功返回1
   assoc.next(idx); // 找到下一个元素，并将其索引值赋给idx，如果失败返回0，成功返回1
   assoc.delete(idx); // 删除元素
   assoc.prev(idx);
   assoc.last(idx);
   assoc.exists(idx);
#+END_SRC

- 使用字符串作为索引，实现字符串到数字的映射。
#+BEGIN_SRC verilog
   int switch[string];
   int max_addr;
   max_addr = switch.exists("max_addr") ? switch["max_addr"] : 1000;
   switch.exists; //判断元素是否存在

#+END_SRC

**** 2.6 链表
类似c++的列表容器，sv 队列更高效，不推荐使用链表。

**** 2.7 数组的方法

***** 2.7.1 数组缩减方法
- 需要注意 sv 处理操作尾款的规则。
- 常用的缩减方法，
  - sum
  - product
  - and
  - or
  - xor
- 例子
  - bit on[10];
  - $display("%d",on.sum); //single bit 1
  - $display("%d",on.sum+32'd0); //32 bits 5
  - int total = on.sum; // total = 5;
  - if (on.sum > 32'd5) // return 1;
- 在数组中随机选取一个元素的方法
  - 可以通过$urandom_range($size(array)-1)
  - 队列和动态数组还可以使用$urandom_range(array.size()-1)
  - 关联数组需要逐个访问它之前的元素
    - int element = $urandom_range(aa.size()-1);
    - foreach(aa[i])
      - if(count++ == element)
        - begin rand_idx = i; break; end
    - aa[rand_idx];

***** 2.7.2 数组定位方法
数组定位函数返回值，通常是一个“队列”。
支持的类型：定宽数组，动态数组，队列
#+BEGIN_SRC verilog
 q_tmp = queue.max(); // maximum value
 q_tmp = queue.min(); // minimum value
 q_tmp = queue.unique(); // delete duplicate values are not include.
#+END_SRC
搜索方法 find：
#+BEGIN_SRC verilog
q_tmp = queue.find with (item>3); // return queue of items
  q_tmp = queue.find_index with ();  //  return items' index
  q_tmp = queue.find_first  with (); // return first item
  q_tmp = queue.find_first_index  with (); //
  q_tmp = queue.find_last  with (); //
  q_tmp = queue.find_last_index  with (); //

#+END_SRC
条件语句 with；重复参数的声明，重复参数 item （默认item，可以修改）；
#+BEGIN_SRC verilog
 tq=d.find with (item > 3); // 大于3的元素
 tq=d.find ()with (item >3);
 tq=d.find (x) with (x >3);
#+END_SRC

***** 2.7.3 数组的排序
排序的方法
#+BEGIN_SRC verilog
d.reverse(); // 倒序
d.sort();  // 升序排序
d.rsort(); // 降序排序
d.shuffle(); // 乱序
#+END_SRC
倒序（reverse）和乱序（shuffle）不可以带with

***** 2.7.4 使用数组定位方法建立记分板
使用结构体定义包，使用队列实现数据存储。

**** 2.8 选择存储类型
参考准则

***** 2.8.1 灵活性
- 索引为非负整数，定宽或者动态数组
  - 确定深度，定宽
  - 运行时确定深度，动态
- 处理数组的子程序，动态
  - 可以处理不同宽度的数组
- 处理数组的子程序，队列或者关联数组
- 数组索引不规则时，关联数组
- 运行中数目变化大的数组，队列

***** 2.8.2 存储器用量
- 双状态类型可以减少仿真时的存储器用量
- 尽量使用32bit的整数倍作为数据位宽
  - 如使用合并数组，可以节省空间
- 数组类型的性能，深度相关
  - 1000，无差别
  - 1,000 ~ 1,000,000 定宽和动态具有最高的存储器使用效率
  - >1,000,000 应当检查设计
- 长度经常发生变化的数组，存放在动态数组中时，大量的new[]和复制，会降低性能
- M字节以上的应当使用关联数组。关联数组元素占用空间大，访问效率低。

***** 2.8.3 速度
少量读写，差别小。
- 定宽和动态数组，每个元素的访问耗时都相同
- 队列首尾操作几乎无差别，中间的操作效率非常低。
- 关联数组最慢

***** 2.8.4 排序
- 一次性赋值使用定宽、动态
- 逐个加入，队列
- 不连续，且彼此互异，可以使用关联
  - 存储32bit的数值，数值生成后直接写入索引位置
    - exist检查是否存在
    - delete删除

***** 2.8.5 选择最优的数据结构
推荐例子
1. 网络数据包。定长，顺序存取。定宽或者动态
2. 保存计分板。一般使用队列。如果元素多，并可能随意增删，使用关联数组
3. 有序结构。顺序输出，队列；乱序输出，关联。如果不需要输出，mailbox。
4. 多有百万级数据，关联。不可用关联，考虑使用合并。
5. 有命令名，或者操作码：索引为字符串的关联数组。

**** 2.9 使用 typedef 创建新的类型
实例
#+BEGIN_SRC verilog
  typedef reg [OPSIZE-1:0] opreg_t;
  typedef bit [31:0] uint;  // 常用无符号int
  typedef int unsigned uint;  // 等效
  typedef int fixed_array5[5] // 定宽数组数据类型，声明后即可以得到int数组
#+END_SRC

**** 2.10 创建用户自定义结构
结构只包含数据，可以综合。

***** 2.10.1 使用 struct 创建新类型
将若干变量组合到一个结构
#+BEGIN_SRC verilog
 struct {bit [7:0] r,g,b;} pixel;  // 创建结构变量
 typedef struct {bit [7:0] r,g,b} pixel_s; // 创建结构类型
#+END_SRC

***** 2.10.2 对结构进行初始化
初始化方法，像数组一样。
#+BEGIN_SRC verilog
 pixel_s my_pixel = '{8'haa,8'hbb,8'hff};
#+END_SRC

***** 2.10.3 创建可容纳不同类型的联合
N选1，多个数据类型能同时存在一个。
#+BEGIN_SRC verilog
 typedef union {int i; real f} num_u;
 num_u un;
 un.f=0.0;
#+END_SRC
要点
+ 若以不同类型对一个寄存器频繁读写时，相当有效
+ 不应为省空间使用，复杂的数据消耗更大
+ 使用类，可以达到同样效果，功能更强大
+ 如果需要提高存储效率，合并数组效果更好

***** 2.10.4 合并结构
可以将结构合并在一起

typedef struct packed {bit [7:0] r,g,b;} pixel_p_s

***** 2.10.5 在合并结构和非合并结构之间进行选择
- 若果只进行复制操作，合并结构效率高
- 如果需要对每个数据都进行运算操作，合并结构的操作开销非常大。不应使用。

**** 2.11 类型转换

***** 2.11.1 静态转换
指定要转换的类型，在表达式外面加单引号。
#+BEGIN_SRC verilog
 int i = int '(10.0-0.1);
#+END_SRC

Verilog 对整数和实数，或者不同位宽的向量之间进行隐式转换。

***** 2.11.2 动态转换
函数 $cast 允许对越界的数值进行检查。

***** 2.11.3 流操作符
- '>>' 和 '<<' 用在赋值表达式右边，后面带表达式、结构或者数组。
- 将后面的数据打包成比特流。>>数据从左至右打包，<<数据从右至左打包。
- 流操作符后，可以接数据类型，或数字。表示按数据类型长度，或者指定长度(从左向右，或者从右向左)对数据进行打包。
例子
#+BEGIN_SRC verilog
 h = {>> {j}};
 h = {>> 4 {j}};
 {>> {q,r,s,t}} = j
#+END_SRC;
***** 2.12 枚举类型
****** 2.12.1 定义枚举类型
****** 2.12.2 枚举类型的子程序
****** 2.12.3 枚举类型的转换

**** 2.13 常量
- const byte colon = ":";
- const 初始化之后不能修改值

**** 2.14 字符串
- 不含 \0 ，动态存储，编号为0到N-1
- 操作符
  - ==
  - !=
  - >= > <= <  //以字典顺序比较值 ASIIC 表值
  - {multiplexer{str}}
  - {str,str,str}
  - str.FUNCTION();
    - function int len();
    - function void putc(int i, byte c);
    - function byte getc(int i);
    - function void toupper();
    - function void tolower();
    - function int compare(string s);
    - function int icompare(string s);
    - function string substr(int i,int j);
    - atoi, atohex, atootc, atobin, atoreal
    - itoa, hextoa, otctoa, bintoa, realtoa
- $psprintf("%s %5d",s,42);

**** 2.15 表达式的位宽
#+BEGIN_SRC verilog
bit one = 1'b1
 $displayb(one+one) //0
 bit [7:0] b8 = one + one; // 2
 $displayb(one+one + 2'b0) // 2
 $displayb( 2 ' (one)  +one) // 2 ,强制类型转换
#+END_SRC

**** 2.16 结束语
fuck 花了好长时间，才看完。

*** Chp3 过程语句和子程序
c语言风格的代码

