collection/olddays/org/learnSV/learnSV.tex

\subsubsection*{Chp3 过程语句和子程序}
\label{sec:org8718161}
c语言风格的代码

\begin{itemize}
\item 3.1 过程语句
\label{sec:org8851b76}
\begin{itemize}
\item begin\ldots{}end fork\ldots{}join 可以添加标号
\item ++ -- 可以作为前缀和后缀
\item SV添加了continue 和 break，verilog只支持disable
\end{itemize}

\item 3.2 任务、函数以及void函数
\label{sec:org4df895a}
\begin{itemize}
\item Verilog 中function必须有返回值，返回值必须被使用
\item SV 中允许函数调用任务，只允许在fork..join\(_{\text{none中}}\)
\item 不消耗事件的任务，应使用void函数，以便被调用
\item 如果想忽略函数的返回值，可以使用void进行结果转换
\begin{itemize}
\item void ' (\$fscanf(file,"\%d",i));
\end{itemize}
\end{itemize}

\item 3.3 任务和函数概述
\label{sec:org1d117fe}
不带参数的子程序不需要带空括号。但是可以带。

\begin{itemize}
\item 3.3.1 在子程序中去掉 begin\ldots{}end
\label{sec:org9a850c4}
begin\ldots{}end不在是必须的关键词
\end{itemize}

\item 3.4 子程序参数
\label{sec:orgad10acd}
\begin{itemize}
\item 3.4.1 c语言风格的子程序参数
\label{sec:org3fefbe3}
c语言风格时，必须使用logic类型。（合理，但实测可以使用reg，int等其他类型）。
\begin{verbatim}
task mytask1 (output logic [31:0] x,input logicy);
...
endtask
\end{verbatim}

\item 3.4.2 参数的方向
\label{sec:org28cb633}
输入方向的关键字(input)可以省略，不建议省略。

\item 3.4.3 高级的参数类型
\label{sec:org27cbb63}
\begin{itemize}
\item verilog 中子程序对于参数都是做复制操作，in、out、inout。
\item SV 中新增 ref 指定参数为引用。这样将数组传递给子程序，效率高
\item SV 中可以不带ref传递参数，此时使用的是复制方式，资源消耗大
\item SV 中 ref 只能用于带自动存储的子程序 （automatic属性）
\item 当不需要改变数组值得时候加上 const 修饰，则子程序修改参数时，编译器会报错。
\item SV 中 ref 类型的参数在子程序值发生改变时，外部可以立即得到。而不带ref的参数则会在子程序结束后，才更新。
\end{itemize}
\begin{verbatim}
task automatic task1(ref bit [31:0] a []);
...
endtask
\end{verbatim}

\item 3.4.4 参数的缺省值
\label{sec:orgd3ad288}
\begin{itemize}
\item 可以允许子程序带有缺省值
\begin{verbatim}
function void func1(int low=0,high=-1);
...
endfunction
\end{verbatim}
\item 使用-1（或者其他越界值）作为缺省值，对于获知调用时是否有指定值，是一个有效的方法。
\end{itemize}

\item 3.4.5 采用名字进行参数传递
\label{sec:orgf100c13}
\begin{itemize}
\item SV 中允许子程序，使用类似模块借口的方式进行参数设置
\begin{verbatim}
initial begin
 many(,6, .d(8));
end
\end{verbatim}
\end{itemize}

\item 3.4.6 常见的代码错误
\label{sec:orgbb77983}
\begin{itemize}
\item 缺省的参数类型与前一个参数类型相同
\item 应当为每个参数明确指定参数类型（in、out、inout、ref）
\end{itemize}
\end{itemize}

\item 3.5 子程序的返回
\label{sec:org2f5a2a8}
Verilog 中，当function运行结束后，返回一个与函数同名的变量。
\begin{itemize}
\item 3.5.1 返回语句
\label{sec:org1ed28fd}
\begin{itemize}
\item return 可以让代码更规整。
\end{itemize}

\item 3.5.2 从函数中返回一个数组
\label{sec:org45e85e9}
三种方法
\begin{itemize}
\item 先定义数组类型，然后将函数的返回类型定义为为数组，性能低
\item 将返回值设为void，向函数传入ref类型的数组参数，性能高
\item 将数组封装到类（class）中，返回对象（object）的句柄。
\end{itemize}
\end{itemize}

\item 3.6 局部数据存储
\label{sec:org3bd4749}
Verilog 是HDL，所有对象都是静态存储，非基于堆栈。导致无法使用递归子程序一类的动态代码。

\begin{itemize}
\item 3.6.1 自动存储
\label{sec:orgc095e04}
\begin{itemize}
\item 多个地方调用同一个任务时，由于任务里的局部变量使用共享的静态存储区，所以会串用局部变量。
\item automatic可以指定任务(task)、函数(function)、模块(module)强制使用堆栈区存储局部变量。
\item SV 中module 和program 默认是用静态存储，（经测试task也是静态）
\end{itemize}

\item 3.6.2 变量的初始化
\label{sec:org16563ad}
\begin{itemize}
\item SV 允许在代码任意位置声明变量
\item SV 中默认情况下，任意位置声明的变量都是静态存储的。（initial 块中，需要在其他代码之前声明变量）
\begin{itemize}
\item 这意味着，仿真前就已经做了声明。
\begin{itemize}
\item 如果声明中带有初始化的值，而初始值又是另外一个变量，则代码可能出错。
解决方法
\begin{enumerate}
\item 强制为动态存储，添加automatic
\item 声明中去除初始化
\end{enumerate}
\end{itemize}
\end{itemize}
\end{itemize}
\end{itemize}

\item 3.7 时间值
\label{sec:orgc7c2691}

\begin{itemize}
\item 3.7.1 时间单位和精度
\label{sec:org94d4574}
\begin{itemize}
\item 可以使用timeunit timeprecision 取代 `timescale
\item 如果使用 timeunit timeprecision， 则必须每个有时延的模块都必须添加 timeunit timeprecision；
\end{itemize}

\item 3.7.2 时间参数
\label{sec:org68dae91}
\begin{itemize}
\item \$timeforamt \$time \$realtime
\end{itemize}

\item 3.7.3 时间和变量
\label{sec:org34c7d8a}
\begin{itemize}
\item time , real 类型赋值可以加时间单位 800fs
\end{itemize}

\item 3.7.4 \$time 与 \$realtime 的对比
\label{sec:org1850034}
\begin{itemize}
\item \$time 整数
\item \$realtime 有小数位的实数
\end{itemize}
\end{itemize}

\item 3.8 结束语
\label{sec:org039d822}
\end{itemize}

\subsection*{Part 2}
\label{sec:org46ac096}
\subsubsection*{Chp4 连接设计和测试平台}
\label{sec:orgb452572}
核心概念是：除了待测设计的行为之外，测试平台仿真了其他的所有行为。

\begin{itemize}
\item 4.1 将测试平台和设计分开
\label{sec:org2b55bea}
\begin{description}
\item[{interface}] 使用接口（interface）可以解决测试模块，与测试平台之间的连接问题。
\item[{program}] 程序块（program block）可以从逻辑和时间上分开测试平台。
\end{description}

\begin{itemize}
\item 4.1.1 测试平台和 dut 之间的通信
\label{sec:orgd589adf}
仲裁器的例子

\item 4.1.2 与端口的通信
\label{sec:org71ae6cb}
老式的实现方法，不灵活、易错。

\begin{description}
\item[{待测模块}] arb，仲裁器实现。
\item[{测试平台}] test，测试平台，不带时钟产生器，但是有复位（reset）产生器。
\item[{顶层}] top，例化仲裁器，测试平台和时钟产生器。
\end{description}
\end{itemize}

\item 4.2 接口
\label{sec:org14830e9}
接口包含，连接，同步，两个或多个模块间的通信功能，它们连接了设计快和测试平台。

\begin{itemize}
\item 4.2.1 使用接口来简化连接
\label{sec:org79aa69a}
SV 中进行模块设计的时候，可以将端口（port）封装到接口（interface）中。
\begin{verbatim}
interface arb_if(input bit clk);
endinterface

module arb(arb_if arb_if)
endmodule : arb

module top;
bit clk;
always #5 clk = ~clk;
arb_if arb_if(clk);
arb a1 (arb_if);
test t1 (arb_if);
endmodule :top
\end{verbatim}
接口声明必须在模块和程序块之外。如 include if.sv 要在top module外面。

\item 4.2.2 连接接口和端口
\label{sec:orgd1434ed}
需要对verilog-2001兼容时，可以将接口（interface）连接到设计块的端口（port）上。

\item 4.2.3 使用 modport 将接口中的信号分类
\label{sec:org8b3cfa2}
在interface中，使用modport，定义不用的接口方向分组。通常在模块设计块的接口声明中，确定接口的modport类型。必要时可以在top中连接设计的时候，再确定类型。
\begin{verbatim}
interface arb (input bit clk);
modport TEST(output request, rst
            input grant, clk);
modport DUT (...);
modport ...
endinterface

module arb(arb_if.DUT arb_if)
endmodule : arb
\end{verbatim}

\item 4.2.4 在总线设计中使用 modport
\label{sec:orgf08bb3f}
并不是接口中每个信号都必须连接。

\item 4.2.5 创建接口监视模块
\label{sec:org10402eb}
连接接口中信号，并输出接口行为的相应信息。

\item 4.2.6 接口的优缺点
\label{sec:orgba6ae21}
接口可以例化接口，不可以例化模块。
\begin{itemize}
\item 优势
\label{sec:org375fbf1}
\begin{itemize}
\item 利于设计重用
\item 减少模块间的连接错误
\item 信号增加减少只需要在接口中声明，不需要改变上层设计
\item modport 可以捆绑信号，可以指定信号方向，方便模块自检。
\end{itemize}

\item 劣势
\label{sec:org43967c9}
\begin{itemize}
\item 对于点对点的连接，modport 一样冗长。只是将接口放在一起了，方便工具检测。
\item 必须同时使用信号名和接口名，模块可能更加冗长。

\item 如果不重用，接口做的事情比端口更多。
\item 连接两个不同的接口很困难。需要拆分，并正确的驱动。
\end{itemize}
\end{itemize}

\item 4.2.7 更多的例子和信息
\label{sec:orgcfe06b5}
\end{itemize}

\item 4.3 激励时序
\label{sec:org3626414}
需要注意驱动和接受信号的同步。避免时序竞争问题。

\begin{itemize}
\item 4.3.1 使用时钟块控制同步信号的时序
\label{sec:orgdea61e6}
时钟块定义了信号的时序关系，时钟块同时指明了接口信号的输入输出关系。在 modport 中可以直接使用时钟块。

\item 4.3.2 接口中的logic和wire对比
\label{sec:org1a34ce6}
\begin{itemize}
\item wire 更加方便复用，在initial块中不可以直接赋值，但是可以多驱动
\item logic 更加易用，可以在initial块中直接赋值，不可以多驱动
\end{itemize}

\item 4.3.3 verilog 中的时序问题
\label{sec:org94f1436}
无法做到完全跟事实一致。

\item 4.3.4 测试平台--设计见的竞争状态
\label{sec:orgc094958}
使用非阻塞赋值，使得信号无冲突。

\item 4.3.5 程序块（program block） 和时序区域（timing region）
\label{sec:orgd997107}
\begin{itemize}
\item 时序冲突的根源是，测试波形和设计混合在一起了。
\item sv 将时间节点处理过程分成了 active observe reactive postponed 四个过程
\begin{description}
\item[{active}] simulation of design code in module
\item[{observe}] evaluation of system verilog assertion
\item[{reactive}] execution of testbench code in programs
\item[{postponed}] sampling design signals for testbench input
\end{description}
\item 测试代码应当包含在一个单个program中。
\item 应使用对象 oop，而非模块实现动态，分层的测试平台。一次仿真可能有多个程序块。
\item 应当使用automatic修饰程序块。
\end{itemize}

\item 4.3.6 仿真的结束
\label{sec:org16bc17d}
\begin{itemize}
\item 所有程序块中所有initial的最后一句时，仿真结束。
\item 可以使用 \$exit 结束程序块
\item 可以使用 \$finish 结束仿真
\end{itemize}

\item 4.3.7 指定设计和测试平台之间的延时
\label{sec:org8d848cf}
\begin{itemize}
\item 在postpone region，所有的值都会被锁定。
\item 可以认为时钟块做了时间节点上 design 和 testbench 的同步。
\end{itemize}
\end{itemize}

\item 4.4 接口的驱动和采样
\label{sec:orgcdb69d3}
\begin{itemize}
\item 4.4.1 接口同步
\label{sec:org2eb0818}
使用 @ 或者 wait 作为接口信号的同步

\item 4.4.2 接口信号采样
\label{sec:org96a43e3}
在时钟块中(clock block)采样值，为变化边沿前的值。

\item 4.4.3 接口信号驱动
\label{sec:orgefb9305}
使用带时钟块(clocking block)的 modport 时，时钟同步的接口信号，应当加上接口名(interface)和时钟块名(clocking block)。

\item 4.4.4 通过时钟块驱动接口信号
\label{sec:org467dfd6}
\begin{itemize}
\item testbench中，在时钟有效边沿使用阻塞赋值，数值可以立即传输到design中；如果不在时钟边沿使用阻塞赋值，数值会在下一个有效边沿传输到design中。
\item 带时钟块(clocking block)的接口中，使用阻塞赋值可能出现数据丢失.
\item 时钟块中的延时控制 必须有明确指明时钟
\begin{description}
\item[{\#\#0}] 如果当前为时间点(time slot)，则即时改变值，否则下一个有效边沿.
\item[{\#\#1}] 即时当前为时间点(time slot)，也在下一个有效边沿改变值.
\item[{\#\#2}] 2个有效时钟边沿。 类似 repeat (2) @arb\(_{\text{if.cb}}\)
\item[{注意}] \#\#3 后面必须要带赋值语句。
\begin{itemize}
\item 合法
\begin{verbatim}
##2 arbif.cb.request <=0;
\end{verbatim}
\item 非法
\begin{verbatim}
##2 ;
\end{verbatim}
\end{itemize}
\end{description}
\end{itemize}

\item 4.4.5 接口中双向信号
\label{sec:org740f40c}
程序中可以直接对双向信号进行读取、赋值操作。
\item 4.4.6 为什么不在程序（program）中不允许使用always块
\label{sec:org3e6dac7}
\begin{itemize}
\item testbench 中的 always 可能不正常工作
\item testbenc 中有 always ，则 testbench 将不能正常结束。
\item 可以使用 initial forever 实现
\end{itemize}
\item 4.4.7 时钟发生器
\label{sec:org67e1260}
时钟块应在design中实现。
\end{itemize}
\item 4.5 将这些模块连接起来
\label{sec:org90b68e3}
在top连接design和testbench。
\begin{verbatim}
module top;
 bit clk;
always #4 clk=~clk;

arb_if arbif(.*);
arb a1(.*);
test t1(.*);
endmodule
\end{verbatim}
.* 为端口的省略写法。

\begin{itemize}
