collection/olddays/org/learnSV/learnSV.org
***** 4.5.1 端口列表（port list）中的接口（interface）必须连接
端口（port）有接口（interface）的模块，必须声明了接口，才可以编译通过。
#+BEGIN_SRC verilog
module top;
 bit clk;
always #4 clk=~clk;

arb_if arbif(clk);
arb a1(arbif);
endmodule
#+END_SRC

**** 4.6 顶层作用域
- $unit :: 编译时的顶层引用路径
- $root :: elaborate之后的顶层路径
- 顶层模块的显式例化 ::
     #+BEGIN_SRC verilog
     `timescale 1ns/1ns
     top t1();
     module top;
         ....
     endmodule
     `define TOP $root.top
     program automatic test;
     ...
     endprogram
     #+END_SRC

**** 4.7 程序--模块交互
可以在design中添加function接口，方便 testbench 访问design中的数据。
第10章中，有示例如何在接口(interface)中使用function和断言。

**** 4.8 system verilog 断言
可以使用时序断言，并跟踪断言。通过断言，可以收集功能覆盖率。

***** 4.8.1 立即断言（Immediate Assertion）
- 断言逻辑 :: 不符合断言条件，则会触发断言。

***** 4.8.2 定制断言行为
- then, else ::
断言支持then分句和else分句。
#+BEGIN_SRC verilog
a1: assert (bus.cb.grant == 2'b01)
   grants_received++;
else
  $error("grant not assert");
#+END_SRC
- 4个输出消息的函数 :: $info, $warning, $error, $fatal.

***** 4.8.3 并发断言(concurrent assertions)
- 等效连续运行的模块。
#+BEGIN_SRC verilog
interface arb_if(input bit clk);
 ...

 property request_2state;
   @(posedge clk) disable iff (rst);
   $isunknown(request) == 0;
 endproperty
endinterface
#+END_SRC

***** 4.8.4 断言的进一步探讨

**** 4.9 四端口的 atm 路由器
***** 4.9.1 使用端口的 ATM 路由器
***** 4.9.2 使用端口的 ATM 顶层网单
***** 4.9.3 使用接口简化连接
***** 4.9.4 ATM 接口
***** 4.9.5 使用接口的 ATM 路由器模型
***** 4.9.6 使用接口的 ATM 顶层网单
***** 4.9.7 使用接口的 ATM 测试平台
**** 4.10 ref 端口的方向
**** 4.11 仿真结束
**** 4.12 LC3取值模块的定向测试



*** Chp5 面对对象编程基础
**** 5.1 概述
**** 5.2 考虑名词，而非动词
- 传统 :: 创建事务，发送，接收，检查结果。
- oop :: generator，driver，monitor，scoreboard，blocks
- 对比 :: 传统倾向于数据流动，oop倾向于将每个独立的事情分裂出来。
**** 5.3 第一个类
- endtask endfunction 等中添加label
- 代码风格
**** 5.4 在哪里定义类
program，module，package或者这些位置之外的任意位置。
可以使用包把类定义和类型定义捆绑在一起。

**** 5.5 oop术语
class 类，object 对象，handle 句柄，property 属性，method 方法，prototype 原型（程序头，程序名，返回类型，参数列表）

**** 5.6 创建新对象
对象在运行时才被创建。

***** 5.6.1 句柄和构造函数
声明一个类的变量时，此变量名称即为句柄。

***** 5.6.2 定制构造函数
new()可以有输入参数，可以部分参数赋值，方法与module的例化赋值方法类似。
new()的调用取决月赋值操作符左边的句柄类型

***** 5.6.3 将声明和创建分开   :特别注意:
声明类的变量和构造函数应当分开；
普通变量的声明和初值应当分开，在task中，没有分开的变量声明和赋初值，初值可能会不生效。

***** 5.6.4 new[] 和 new()
new[] 是动态数组分配空间，new()是构造函数。

***** 5.6.5 为对象创建一个句柄
可以改变句柄handle指向的对象object
一个object可以有多个handle。没有handle指向object的时候，object将会被回收。

**** 5.7 对象的解除分配
当没有指向句柄指向对象，则对象将会被回收。将句柄指向null，可以将空间释放。
如果是链表的话，则需要手动将每个对象进行释放。
如果对象中有从线程中派生出来的程序，只要线程仍在运行，曾对象空间不会别释放。

**** 5.8 使用对象
严格的OOP规定，只能通过对象的公有方法访问对象的变量。
测试平台需要最大限度的控制所有的变量，以产生最广泛的激励。

**** 5.9 静态变量和全局变量
- task一定要注意添加automatic修饰，避免同时调用时产生的冲突。
- class中的task默认为automatic，其他位置默认为static。

***** 5.9.1 简单的静态变量
- 类中的静态变量将被这个类的所有实例共享。
- 应用实例
  使用静态变量count记录实例个数。
  每个类中建立非静态变量ID， new函数中， id=count++

***** 5.9.2 通过类名访问静态变量
使用类名作用域操作符 :: 访问静态变量。

***** 5.9.3 静态变量的初始化
静态变量的初始化不应当在构造函数中实现。
静态变量的初始化可以有专门的初始化函数，但需要保证初始化函数在第一个类的实例构造之前，已使用了静态变量的初始化函数。

***** 5.9.4 静态方法
类中的方法默认为automatic，使用使用static的方法，优化实现。
不允许静态方法读写非静态方法。

**** 5.10 类的方法
默认为自动存储的

**** 5.11 将类的方法定义在类的外面。
- 提高可读性
- extern
  在类中声明方法，加extern 修饰。
- 类作用域符:: 。
  在外面定义方法时，必须要指定累作用域。

**** 5.12 作用域规则
- 使用 点(.)索引变量
- 使用时，建议使用完整路径避免错误索引
- 如果在代码上一级中已有变量，隐式声明变量可能会失败，而变成对上一级的引用。因此class应当写在独立的代码文件中，规避错误。
- 使用package 包装class

- this专指类一级的变量。

**** 5.13 在一个类中使用另一个类
将类分解成多个类有利于代码管理

***** 5.13.1 类的大小应该有上限和下限
分解类会带来层次上的复杂度的增加。

***** 5.13.2  编译顺序的问题
如果类包含了一个未定义的类，可以使用typedef class 来声明类名。

**** 5.14 理解动态对象
对象和句柄是一一对应的。句柄可以存储在数组、队列或者另一个对象中。

***** 5.14.1 将对象传递给方法
传递对象是传递的是对象的句柄。因此，方法中对对象的修改会在方法外生效。

***** 5.14.2 在任务中修改句柄
对象的默认信号方向是input，即内部复制句柄的值。
如果需要改变句柄的值，需要将信号方向改为ref。
方向为ref的信号在task外面发生变化时，也会影响task内部信号。

***** 5.14.3 在任务中修改对象
如果对一个对象的进行多次修改再传输句柄，则存在接受的对象可能只有一个数值。
较为稳妥的方法是，每次修改都新建一个对象，或者每次都将传输的对象进行拷贝。

***** 5.14.4 句柄数组
对象没数组，句柄可以有数组。不同的句柄数组中的句柄可以指向相同或者不同的对象。

**** 5.15 对象的复制
使用new函数对对象进行复制，可以使对象专门的复制代码。

***** 5.15.1 使用new操作符复制一个对象
内建的复制函数，复制所有现有对象的变量。
下层对象不会被复制，而是复制了对象的句柄。

***** 5.15.2 简单的复制函数
不包含对其他类的引用，可以写简单的copy函数，正确情况下等效于new。

***** 5.15.3 深层复制函数
对于非简单类，应该创建自己的copy函数。
copy的函数中，应当调用当前类中的子对象的copy函数，保证数据的完整性。

***** 5.15.4 使用数组对对象进行打包和解包。
把对象的需要打包的数据使用流操作符，打包到bytes，（UVM中自带pack函数）
#+BEGIN_SRC verilog
class transaction;
function void pack(ref byte bytes[40]);  //Care about the key word 'ref'
bytes={>>{addr,crc,data}};
endfunction
function void pack(ref byte bytes[40]);
bytes={>>{addr,crc,data}};
endfunction
endclass
#+END_SRC

**** 5.16 public & local
oop大部分默认local，sv默认公有。

**** 5.17 题外话
多考虑使用类

**** 5.18 建立平台

*** Chp6 随机化

**** 6.1 介绍

测试向量太多，向量交互的点是bug的来源。
必须采用产生子集的方式来解决这个问题。

**** 6.2 什么需要随机化

有挑战性的bug大都在控制路径中。所有的关键点都采用随机的技术

***** 6.2.1 器件配置

例子：多个配置的dut的环境中，使用随机的方法产生配置，然后传输给dut。

***** 6.2.2 环境配置

例子：硬件dut为固定，接口可以连接若干个总线模型（bfm）。控制bfm的行为，模仿不同环境。

***** 6.2.3 原始输入数据

数据值的随机，和涉及协议的各个层次以及故障注入。

***** 6.2.4 封装后的输入数据

例子：tcp数据，ip协议各个层都含有不同的控制域，通过随机各种控制域的配置，需要考虑如何注入错误。

***** 6.2.5 协议异常、错误（error)和违规（violation)

需要考虑各种测试边界，协议中明确的问题和可能隐含的问题。

***** 6.2.6 延时

需要测试所有符合协议要求的随机的测试。

**** 6.3 sv中的随机化

***** 6.3.1 带有随机数的简单类

#+BEGIN_SRC verilog
class packet;

   rand bit [31:0] src,dst,data[8];
   rand bit [7:0] kind;

   constraint c
     {src > 10;
      src > 15;}

endclass

packet p;

initial begin
   p=new();
   assert (p.randomize());
   else $fatal(0,"packet::randomize failed");
   transmit(p);

end

#+END_SRC

- 不应在类的构造函数中调用randomize()
- 类中所有的变量应当是random和public，方便全面的测试dut

***** 6.3.2 检查随机化的结果
应当使用断言检查randomize()，是否随机成功。否则可能出现异常。

***** 6.3.3 约束求解
随机数发生器，因不同工具，版本而得到不同的解。

***** 6.3.4 什么可以被随机化
不能随机化字符串。

**** 6.4 约束
约束的表达式中，应当含有rand 或 ranc 。

***** 6.4.1 什么是约束

***** 6.4.2 简单表达式
一个表达式中只能使用一个关系表达式。

***** 6.4.3 等效表达式
可以使用复杂的表达式

***** 6.4.4 权重分布
- dist操作符允许产生权重分布
- :=  表示值范围内的每一个值的权重都是相同的
- :/  表示权重均匀分到范围内的每一个值
- 权重可以是常数或者变量

***** 6.4.5 集合(set)成员和inside运算符
#+BEGIN_SRC verilog
 c inside {[lo:hi]};
 c inside {[$:lo],[hi:$]};
 !(c inside {[lo:hi]})
#+END_SRC

