collection/olddays/org/learnSV/learnSV.org
***** 6.4.6 在集合里使用数组
#+BEGIN_SRC verilog
rand int f;
int fib[5] = '{1,2,3,5,8};
constraint c_fibonacci{
f inside fib;
}
#+END_SRC
-  数组中重复出现值，概率不会被影响。

#+BEGIN_SRC verilog
class Days;
typedef enum {SUN,MON,TUE,WED,THU,FRI,SAT} days_e;
days_e choices[$];
endclass
Days days;
days=new();
days.choices={Days::SUM,Days::SAT};
#+END_SRC

- ranc: random-cyclic 循环穷尽随机
***** 6.4.7 条件约束
- "->"
- "if-else"
-  约束中 {} 可以嵌套？？？
***** 6.4.8 双向约束
- 随机结果需要使所有条件满足
***** 6.4.9 使用合适的数学运算来提高效率
求解约束时，移位比除法高效。
**** 6.5 解的概率

***** 6.5.1 没有约束的类
没有约束条件下，各概率相同。

***** 6.5.2 关系操作
#+BEGIN_SRC verilog
     class impl;
        rand bit x;
        rand bit [1:0] y;
        constraint c_xy {
           (x==0) -> y==0;
        }
         // x=0,y=0 概率为1/2， x=1, y=0/1/2/3概率各为1/8
     endclass
#+END_SRC

***** 6.5.3 关系操作和双向约束作
#+BEGIN_SRC verilog
     class impl;
        rand bit x;
        rand bit [1:0] y;
        constraint c_xy {
           y>0;
           (x==0) -> y==0;
        }
         // 约束双向，x=1, y=1/2/3概率各为1/3. 其他的解概率为0
     endclass
#+END_SRC

***** 6.5.4 使用 solve...before 约束引导概率分布作
#+BEGIN_SRC verilog
     class impl;
        rand bit x;
        rand bit [1:0] y;
        constraint c_xy {
           (x==0) -> y==0;
           solve x before y;
        }
         // x=0,y=0 概率为1/2， x=1, y=0/1/2/3概率各为1/8
     endclass
#+END_SRC
若solve y before x，则 x=0/1,y=0 概率为1/8， x=1, y=1/2/3概率各为1/4
除非必要，应当避免使用solve before。

**** 6.6 控制多个约束快
handle.constraint_mode();  // 控制所有的约束。
handle.constraint.constraint_mode(); //控制某一个约束。

**** 6.7 有效性约束
使用约束来制定规则，然后用规则产生测试激励。
#+BEGIN_SRC verilog
     class tran;
        rand enum {BYTE,WORD,LWRD,QWRD} length;
        rand enum {READ,WRITE,RMW,INTR} opc;
        constraint valid_RMW_LWRD
          {
           (opc==RMW) -> length==LWRD;
           }
     endclass
#+END_SRC

**** 6.8 内嵌约束
临时的约束，可以不修改类定义，直接使用randomize () with{}控制变量的生成。
**** 6.9 pre_randomize和post_randomize函数

***** 6.9.1 构造浴缸型分布
使用 pre_randomize 做预生成任务。
#+BEGIN_SRC verilog
function  void pre_randomize();
value = $dist_exponential(seed,DEPTH);
endfunction
#+END_SRC

***** 6.9.2 关于void函数
pre_randomize和post_randomize函数，不能消耗时间。

**** 6.10 随机函数
| 函数              | 功能                   |
|-------------------+------------------------|
| $random           | 平均分布，32位有符号数 |
| $urandom          | 平均分布，32位无符号数 |
| $urandom_range    | 指定范围的平均分布     |
| $dist_exponential | 指数衰落               |
| $dist_normal      | 钟型分布               |
| $dist_poisson     | 钟型分布               |
| $dist_uniform     | 平均分布               |

**** 6.11 约束的技巧和技术

***** 6.11.1 使用变量的约束
- inside 操作符 [lo:hi]，改变lo，hi值动态改变上下限。
- dist 操作符{ a := a_wt, b := b_wt , c := c_wt} ，改变a_wt，b_wt，c_wt来改变各取值的权重。

***** 6.11.2 使用非随机值
- rand_mode(0)
  设置固定值
  #+BEGIN_SRC verilog

  p.lenth.rand_mode(0);
  p.lenth = 42;
  assert(p.randomize());
  #+END_SRC

***** 6.11.3 用约束检查值的有效性
随机化后，检查值的有效性
handle.randomize(null)

***** 6.11.4 随机化个别变量
#+BEGIN_SRC verilog
handle.randomize(a);
handle.randomize(b);
#+END_SRC

***** 6.11.5 打开或关闭约束
可以使用多个约束块，减少if-else的使用，简化大约束块。

***** 6.11.6 在测试过程中使用内嵌约束
randomize with ()

***** 6.11.7 在测试过程中使用外部约束
外部的约束块，可能有问题。
#+BEGIN_SRC verilog
class packet;
 ......
 constraint c_external;
endclass

#+END_SRC
#+BEGIN_SRC verilog
program automatic test;
include "packet.sv"
constraint Packet::c_external{lenth == 1；}
endprogram
#+END_SRC

***** 6.11.8 扩展类
继承

**** 6.12 随机化的常见错误

***** 6.12.1 小心使用有符号变量

***** 6.12.2 提高求解器性能的技巧

**** 6.13 迭代和数组约束

***** 6.13.1 数组的大小

***** 6.13.2 元素的和

***** 6.13.3 数组约束的问题

***** 6.13.4 约束数组和队列的每一个元素

***** 6.13.5 产生具有唯一元素值的数组

***** 6.13.6 随机化句柄数组

**** 6.14 产生原子激励和场景

***** 6.14.1 和历史相关的原子发生器

***** 6.14.2 随机序列

***** 6.14.3 随机对象数组

***** 6.14.4 组合序列

**** 6.15 随机控制

***** 6.15.1 用 randcase 建立决策树

**** 6.16 随机数发生器

***** 6.16.1 伪随机数发生器

***** 6.16.2 随机稳定性--多个随机发生器

***** 6.16.3 随机稳定性和层次化种子

**** 6.17 随机器件配置

**** 6.18 结论



*** Chp7 线程以及线程间的通信

所有仿真行为都是独立的线程。sv 调度器选择下一个要运行的线程。通过控制线程，控制仿真行为。
线程中的通信，有标准的Verilog的事件 event，事件控制 event control, wait 语句，和system Verilog的mailbox，旗语semaphores。

**** 7.1 线程的使用

program中不可以有always，可以使用initial forever实现。
fork...join
fork...join_none
fork...join_any
event,  @ event, wait, disable

***** 7.1.1 使用fork...join和begin...end

所有代码并发执行。
所有分支完成后才执行join后面的任务。

***** 7.1.2 使用fork...join_none来产生线程

fork...join_none块在调度其块内语句是，父线程继续执行。

***** 7.1.3 使用fork...join_any实现线程同步

任一个语句完成后，父线程才能继续执行。

***** 7.1.4 在类中创建线程

在类中，以任务的方式启动新的线程。
#+BEGIN_SRC verilog
class Gen_drive;
task run(int n);
   pack p;
   fork
       repeat (n) begin
          p=new();
          assert(p.randomize());
          transmit(p);
       end
   join_none
endtask
endclass
#+END_SRC

***** 7.1.5 动态线程

使用fork...join_none，可动态产生新的线程。不需要等待其他的线程先完成。
例子：仿真开始时，产生多个随机事务，传输事务，为每个事务产生一个后处理线程。

***** 7.1.6 线程中的自动变量

如果不是automatic 的 program 或 module，各线程会共享相同的变量，导致后面的值覆盖前面的值。
解决方式有2中
- 在静态的的 program 中定义 automatic的变量
  #+BEGIN_SRC verilog
  program bug_free;
    initial begin
     for (j=0; j<3; j++)
       fork
         automatic int k =j;
         $write(k);
       join_none
    end
  endprogram
  #+END_SRC
- 在automatic的 program中，在fork...join_none外定义变量
  #+BEGIN_SRC verilog
  program automatic bug_free;
    initial begin
     for (j=0; j<3; j++)
        int k =j;
        fork
          $write(k);
        join_none
    end
  endprogram
  #+END_SRC
PS: vcs 中不正确，ncsim中正确。应当避免在for中，使用fork...join。

***** 7.1.7 等待所有衍生线程

使用 wait fork 等待线程(fork...join_none)结束。

***** 7.1.8 在线程间共享变量

- bug
  在类内部的子程序中，可以是用局部变量，类变量或者在程序中定义的变量。
  sv会往更高层的作用范围中寻找，直到找到匹配的声明。
- solution
  在包含所有变量使用的最小范围内声明所有的变量。
  尽可能使用foreach

**** 7.2 停止线程

disable可以用于停止system Verilog 中的线程

***** 7.2.1 停止单个线程

在fork...join_any块中创建超时警告线程。
为fork...join_any添加label
线程任务完成，结束fork...join_any
#+BEGIN_SRC verilog
task check;

   fork
      begin
         fork :  time_out_blk
            begin
               task_real_job();
            end
            # TIME_OUT $display("timeout");
         join_any
         disable time_out_blk;
      end
   join_none // spawn threadm don't block

endtask

#+END_SRC

***** 7.2.2 停止多个线程

disable fork 停止当前fork...join产生的线程与各级子线程。
如果只需停止单个线程，disable <lable> 更保守。

***** 7.2.3 禁止被多次调用的任务

同一个任务如果在多个进程中被调用，则任意一个任务被 disable 终止的话，其他的进程中的任务也是结束。

**** 7.3 线程间的通信

通信包括三成员，producer、consumer、communication channel。

**** 7.4 事件

-> 触发事件
@　边沿事件阻塞
事件发生竞争时，使用triggered()函数，查询事件是否触发。

***** 7.4.1 在事件的边沿阻塞

关键字： event
使用方法： -> event; @ event;

***** 7.4.2 等待事件的触发

wait(e1.triggered()) 只要事件曾被触发，则为有效电频

