collection/olddays/org/learnSV/learnSV.tex
constraint c_fibonacci{
f inside fib;
}
\end{verbatim}
\begin{itemize}
\item 数组中重复出现值，概率不会被影响。
\end{itemize}

\begin{verbatim}
class Days;
typedef enum {SUN,MON,TUE,WED,THU,FRI,SAT} days_e;
days_e choices[$];
endclass
Days days;
days=new();
days.choices={Days::SUM,Days::SAT};
\end{verbatim}

\begin{itemize}
\item ranc: random-cyclic 循环穷尽随机
\end{itemize}
\item 6.4.7 条件约束
\label{sec:orgc7a3900}
\begin{itemize}
\item "->"
\item "if-else"
\item 约束中 \{\} 可以嵌套？？？
\end{itemize}
\item 6.4.8 双向约束
\label{sec:org01386f5}
\begin{itemize}
\item 随机结果需要使所有条件满足
\end{itemize}
\item 6.4.9 使用合适的数学运算来提高效率
\label{sec:org5caad1c}
求解约束时，移位比除法高效。
\end{itemize}
\item 6.5 解的概率
\label{sec:orgb860ea0}

\begin{itemize}
\item 6.5.1 没有约束的类
\label{sec:orgafed2e5}
没有约束条件下，各概率相同。

\item 6.5.2 关系操作
\label{sec:orgb54bd4b}
\begin{verbatim}
class impl;
   rand bit x;
   rand bit [1:0] y;
   constraint c_xy {
      (x==0) -> y==0;
   }
    // x=0,y=0 概率为1/2， x=1, y=0/1/2/3概率各为1/8
endclass
\end{verbatim}

\item 6.5.3 关系操作和双向约束作
\label{sec:org8be5601}
\begin{verbatim}
class impl;
   rand bit x;
   rand bit [1:0] y;
   constraint c_xy {
      y>0;
      (x==0) -> y==0;
   }
    // 约束双向，x=1, y=1/2/3概率各为1/3. 其他的解概率为0
endclass
\end{verbatim}

\item 6.5.4 使用 solve\ldots{}before 约束引导概率分布作
\label{sec:org0964767}
\begin{verbatim}
class impl;
   rand bit x;
   rand bit [1:0] y;
   constraint c_xy {
      (x==0) -> y==0;
      solve x before y;
   }
    // x=0,y=0 概率为1/2， x=1, y=0/1/2/3概率各为1/8
endclass
\end{verbatim}
若solve y before x，则 x=0/1,y=0 概率为1/8， x=1, y=1/2/3概率各为1/4
除非必要，应当避免使用solve before。
\end{itemize}

\item 6.6 控制多个约束快
\label{sec:org41021f2}
handle.constraint\(_{\text{mode}}\)();  // 控制所有的约束。
handle.constraint.constraint\(_{\text{mode}}\)(); //控制某一个约束。

\item 6.7 有效性约束
\label{sec:org9c6f445}
使用约束来制定规则，然后用规则产生测试激励。
\begin{verbatim}
class tran;
   rand enum {BYTE,WORD,LWRD,QWRD} length;
   rand enum {READ,WRITE,RMW,INTR} opc;
   constraint valid_RMW_LWRD
     {
      (opc==RMW) -> length==LWRD;
      }
endclass
\end{verbatim}

\item 6.8 内嵌约束
\label{sec:orgdd4b40b}
临时的约束，可以不修改类定义，直接使用randomize () with\{\}控制变量的生成。
\item 6.9 pre\(_{\text{randomize和post}}\)\(_{\text{randomize函数}}\)
\label{sec:org0ceb60f}

\begin{itemize}
\item 6.9.1 构造浴缸型分布
\label{sec:org340422a}
使用 pre\(_{\text{randomize}}\) 做预生成任务。
\begin{verbatim}
function  void pre_randomize();
value = $dist_exponential(seed,DEPTH);
endfunction
\end{verbatim}

\item 6.9.2 关于void函数
\label{sec:orga67755c}
pre\(_{\text{randomize和post}}\)\(_{\text{randomize函数}}\)，不能消耗时间。
\end{itemize}

\item 6.10 随机函数
\label{sec:org562f84f}
\begin{center}
\begin{tabular}{ll}
函数 & 功能\\
\hline
\$random & 平均分布，32位有符号数\\
\$urandom & 平均分布，32位无符号数\\
\$urandom\(_{\text{range}}\) & 指定范围的平均分布\\
\$dist\(_{\text{exponential}}\) & 指数衰落\\
\$dist\(_{\text{normal}}\) & 钟型分布\\
\$dist\(_{\text{poisson}}\) & 钟型分布\\
\$dist\(_{\text{uniform}}\) & 平均分布\\
\end{tabular}
\end{center}

\item 6.11 约束的技巧和技术
\label{sec:org6954480}

\begin{itemize}
\item 6.11.1 使用变量的约束
\label{sec:orga0283f7}
\begin{itemize}
\item inside 操作符 [lo:hi]，改变lo，hi值动态改变上下限。
\item dist 操作符\{ a := a\(_{\text{wt}}\), b := b\(_{\text{wt}}\) , c := c\(_{\text{wt}}\)\} ，改变a\(_{\text{wt}}\)，b\(_{\text{wt}}\)，c\(_{\text{wt来改变各取值的权重}}\)。
\end{itemize}

\item 6.11.2 使用非随机值
\label{sec:org6ba98ab}
\begin{itemize}
\item rand\(_{\text{mode}}\)(0)
设置固定值
\begin{verbatim}

p.lenth.rand_mode(0);
p.lenth = 42;
assert(p.randomize());
\end{verbatim}
\end{itemize}

\item 6.11.3 用约束检查值的有效性
\label{sec:org63e3b33}
随机化后，检查值的有效性
handle.randomize(null)

\item 6.11.4 随机化个别变量
\label{sec:orgc438ab7}
\begin{verbatim}
handle.randomize(a);
handle.randomize(b);
\end{verbatim}

\item 6.11.5 打开或关闭约束
\label{sec:org0d366c2}
可以使用多个约束块，减少if-else的使用，简化大约束块。

\item 6.11.6 在测试过程中使用内嵌约束
\label{sec:orgd5dfda3}
randomize with ()

\item 6.11.7 在测试过程中使用外部约束
\label{sec:org8f99690}
外部的约束块，可能有问题。
\begin{verbatim}
class packet;
 ......
 constraint c_external;
endclass

\end{verbatim}
\begin{verbatim}
program automatic test;
include "packet.sv"
constraint Packet::c_external{lenth == 1；}
endprogram
\end{verbatim}

\item 6.11.8 扩展类
\label{sec:orgf74ce0a}
继承
\end{itemize}

\item 6.12 随机化的常见错误
\label{sec:org87b8a57}

\begin{itemize}
\item 6.12.1 小心使用有符号变量
\label{sec:org116a999}

\item 6.12.2 提高求解器性能的技巧
\label{sec:org68837be}
\end{itemize}

\item 6.13 迭代和数组约束
\label{sec:org42de06a}

\begin{itemize}
\item 6.13.1 数组的大小
\label{sec:org126c960}

\item 6.13.2 元素的和
\label{sec:org4c6d0da}

\item 6.13.3 数组约束的问题
\label{sec:org9ab166e}

\item 6.13.4 约束数组和队列的每一个元素
\label{sec:orgfa48e7f}

\item 6.13.5 产生具有唯一元素值的数组
\label{sec:org3edf1d2}

\item 6.13.6 随机化句柄数组
\label{sec:orgf293b0d}
\end{itemize}

\item 6.14 产生原子激励和场景
\label{sec:org6990c83}

\begin{itemize}
\item 6.14.1 和历史相关的原子发生器
\label{sec:orge2f256a}

\item 6.14.2 随机序列
\label{sec:orgc92eb94}

\item 6.14.3 随机对象数组
\label{sec:org17f2e52}

\item 6.14.4 组合序列
\label{sec:org4042084}
\end{itemize}

\item 6.15 随机控制
\label{sec:org8f92940}

\begin{itemize}
\item 6.15.1 用 randcase 建立决策树
\label{sec:org8375332}
\end{itemize}

\item 6.16 随机数发生器
\label{sec:org00c0b75}

\begin{itemize}
\item 6.16.1 伪随机数发生器
\label{sec:orgbb52720}

\item 6.16.2 随机稳定性--多个随机发生器
\label{sec:orge92f11d}

\item 6.16.3 随机稳定性和层次化种子
\label{sec:org82825dc}
\end{itemize}

\item 6.17 随机器件配置
\label{sec:org9988c50}

\item 6.18 结论
\label{sec:org073b472}
\end{itemize}



\subsubsection*{Chp7 线程以及线程间的通信}
\label{sec:org92be522}

所有仿真行为都是独立的线程。sv 调度器选择下一个要运行的线程。通过控制线程，控制仿真行为。
线程中的通信，有标准的Verilog的事件 event，事件控制 event control, wait 语句，和system Verilog的mailbox，旗语semaphores。

\begin{itemize}
\item 7.1 线程的使用
\label{sec:orgab8d0d5}

program中不可以有always，可以使用initial forever实现。
fork\ldots{}join
fork\ldots{}join\(_{\text{none}}\)
fork\ldots{}join\(_{\text{any}}\)
event,  @ event, wait, disable

\begin{itemize}
\item 7.1.1 使用fork\ldots{}join和begin\ldots{}end
\label{sec:org8320938}

所有代码并发执行。
所有分支完成后才执行join后面的任务。

\item 7.1.2 使用fork\ldots{}join\(_{\text{none来产生线程}}\)
\label{sec:org0ad4d9c}

fork\ldots{}join\(_{\text{none块在调度其块内语句是}}\)，父线程继续执行。

\item 7.1.3 使用fork\ldots{}join\(_{\text{any实现线程同步}}\)
\label{sec:orga0a0c5f}

任一个语句完成后，父线程才能继续执行。

\item 7.1.4 在类中创建线程
\label{sec:orgd857c16}

在类中，以任务的方式启动新的线程。
\begin{verbatim}
class Gen_drive;
task run(int n);
   pack p;
   fork
       repeat (n) begin
          p=new();
          assert(p.randomize());
          transmit(p);
       end
   join_none
endtask
endclass
\end{verbatim}

\item 7.1.5 动态线程
\label{sec:org8d5454e}

使用fork\ldots{}join\(_{\text{none}}\)，可动态产生新的线程。不需要等待其他的线程先完成。
例子：仿真开始时，产生多个随机事务，传输事务，为每个事务产生一个后处理线程。

\item 7.1.6 线程中的自动变量
\label{sec:org2a7c393}

如果不是automatic 的 program 或 module，各线程会共享相同的变量，导致后面的值覆盖前面的值。
解决方式有2中
\begin{itemize}
\item 在静态的的 program 中定义 automatic的变量
\begin{verbatim}
program bug_free;
  initial begin
   for (j=0; j<3; j++)
     fork
       automatic int k =j;
       $write(k);
     join_none
  end
endprogram
\end{verbatim}
\item 在automatic的 program中，在fork\ldots{}join\(_{\text{none外定义变量}}\)
\begin{verbatim}
program automatic bug_free;
  initial begin
   for (j=0; j<3; j++)
      int k =j;
      fork
        $write(k);
      join_none
  end
endprogram
\end{verbatim}
\end{itemize}
PS: vcs 中不正确，ncsim中正确。应当避免在for中，使用fork\ldots{}join。

\item 7.1.7 等待所有衍生线程
\label{sec:org3b02a3b}

使用 wait fork 等待线程(fork\ldots{}join\(_{\text{none}}\))结束。

\item 7.1.8 在线程间共享变量
\label{sec:org6279399}

\begin{itemize}
\item bug
在类内部的子程序中，可以是用局部变量，类变量或者在程序中定义的变量。
sv会往更高层的作用范围中寻找，直到找到匹配的声明。
\item solution
在包含所有变量使用的最小范围内声明所有的变量。
尽可能使用foreach
\end{itemize}
\end{itemize}

\item 7.2 停止线程
\label{sec:orgf535552}

disable可以用于停止system Verilog 中的线程

\begin{itemize}
\item 7.2.1 停止单个线程
\label{sec:orgc9188c6}

在fork\ldots{}join\(_{\text{any块中创建超时警告线程}}\)。
为fork\ldots{}join\(_{\text{any添加label}}\)
线程任务完成，结束fork\ldots{}join\(_{\text{any}}\)
\begin{verbatim}
task check;

   fork
      begin
         fork :  time_out_blk
            begin
               task_real_job();
            end
            # TIME_OUT $display("timeout");
         join_any
         disable time_out_blk;
      end
   join_none // spawn threadm don't block

endtask

\end{verbatim}

\item 7.2.2 停止多个线程
\label{sec:org6dd455e}

disable fork 停止当前fork\ldots{}join产生的线程与各级子线程。
如果只需停止单个线程，disable <lable> 更保守。

\item 7.2.3 禁止被多次调用的任务
\label{sec:org37c1253}

同一个任务如果在多个进程中被调用，则任意一个任务被 disable 终止的话，其他的进程中的任务也是结束。
\end{itemize}

\item 7.3 线程间的通信
\label{sec:org296d32f}

通信包括三成员，producer、consumer、communication channel。

\item 7.4 事件
\label{sec:orga77d9f0}

-> 触发事件
@　边沿事件阻塞
事件发生竞争时，使用triggered()函数，查询事件是否触发。

\begin{itemize}
\item 7.4.1 在事件的边沿阻塞
\label{sec:org49b09b8}

关键字： event
使用方法： -> event; @ event;

\item 7.4.2 等待事件的触发
\label{sec:orgb119ac4}

wait(e1.triggered()) 只要事件曾被触发，则为有效电频

\item 7.4.3 在循环中使用事件
\label{sec:org6e609f6}
