collection/olddays/org/learnSV/learnSV.org
***** 7.4.3 在循环中使用事件

循环中应当避免使用trigger，因为可能产生零延时循环，死锁。

***** 7.4.4 传递事件

传递事件时，传递的是其指针。因此可以直接传递。

***** 7.4.5 等待多个事件

- wait fork
- 记录下已触发时间的数目
  1) 在program中声明次数变量
  2) 在生成类中使用静态变量。


**** 7.5 旗语

使用旗语可以实现对同一资源的访问控制。令牌，钥匙。

***** 7.5.1 旗语的操作
new 创建一个或多个钥匙的旗语
get 获取一个或多个钥匙
put 返回一个或多个钥匙
try_get 试图获得钥匙而希望不被阻塞

***** 7.5.2 带多个钥匙的旗语

1. 返货的要是可以比取出来的多
2. 获取和返回多个钥匙需要谨慎。
   在多个钥匙的环境中，如果只剩一把钥匙，而去请求2把钥匙，将的阻塞，此时若果有1把钥匙的请求，则成功。
   此例忽略的 fifo 的原则。

**** 7.6 信箱

1. 假设发生器 generator 和驱动器 driver 都是自动的对象。其上下游的数据需要进行交互时，使用共享的数组或者队列的话，读写和阻塞会变得困难。

2. 信箱是有源端和收端的fifo。

3. 信箱是一个对象。需要使用new来例化。可选参数size，默认为0.
   - put 把数据放入信箱中
   - get 把数据从信箱中取出。
   - peek 可以获取信箱中的拷贝，而不移除数据。
   - 信箱满，则put会阻塞，信箱空，则get会阻塞。
   - try_get()和try_peek() 不会发生阻塞。

4. 信箱中的数据可以是单个值，特别的，可以是句柄，但不能是对象。
   - 传输对象时需要，新建对象，才能将对象的指针传输到信箱中，否则传输的是同一个对象。

***** 7.6.1 测试平台里的信箱

- 使用 new 新建传输对象
- 使用 put 传输对象
- 使用 get 获得对象
#+BEGIN_SRC verilog
// instance
 mailbox mbx;
 mbx = new();

// get class
 this.mbx = mbx;

#+END_SRC

***** 7.6.2 定容信箱

- 缺省信箱容量为0，无限大
- 大于0为信箱容量
#+BEGIN_SRC verilog
 mbx = new(1);
#+END_SRC
- 当信箱存满时，put会阻塞。

***** 7.6.3 在异步线程间使用信箱通信

- 实际异步线程中，生产不应当在消费房的前头。
- 没有握手信号，非定容信箱生产与消费将会不同步。

***** 7.6.4 使用定容信箱和探视(peek)来实现线程的同步

- 先使用peek拷贝数据，处理完成后，再使用get消除信箱中的数据。

***** 7.6.5 使用信箱和事件来实现线程的同步

- 同一个时间(time slot)内，只要促发过时间，则event.triggered为高，时间点(time slot)推进后，event.triggered变为0.
- @ event，则只有在触发边沿才会被捕捉到，当同一个时间点(time slot)多次触发时，可以被多次捕捉。如果阻塞和促发同时发生，可能会出现次序的问题。

***** 7.6.6 使用信箱来实现线程的同步

- 可以用一个mailbox来实现握手。无任何毒副作用。
- 使用 mailbox 需要注意数据类型匹配！
- 特例：
  #+BEGIN_SRC verilog
  mailbox rtn;
  rtn = new();
  int i;
  int j;
  rtn.put(-i);  // attention
  rtn.get(j);   // in ncsim, there is an error, for mismatch data type.
  #+END_SRC
  #+BEGIN_SRC verilog
  integer j; // solution 1
  #+END_SRC
  #+BEGIN_SRC verilog
  rtn.put(int ' (-i)); // solution 2
  #+END_SRC

***** 7.6.7 其他同步技术
使用旗语也可以实现阻塞线程，旗语相当于第二个信箱，但是没有信息交互。

**** 7.7 构筑带线程并可实现线程间通信的测试程序

***** 7.7.1 基本的事务处理器

***** 7.7.2 配置类

***** 7.7.3 环境类

***** 7.7.4 测试程序

** Part 3
*** Chp8 面向对象编程的高级技巧
**** 8.1 继承的简介
***** 8.1.1 事务基类
***** 8.1.2 Transaction类的扩展
***** 8.1.3 更多的oop术语
***** 8.1.4 扩展类的构造函数
***** 8.1.5 驱动类
***** 8.1.6 简单的发生器类
**** 8.2 蓝图(blueprint)模式
***** 8.2.1 environment类
***** 8.2.2 一个简单的测试平台
***** 8.2.3 使用扩展的Transaction类
***** 8.2.4 使用扩展类改变随机约束
**** 8.3 类型向下转换(downcasting)和虚方法
***** 8.3.1 使用 $cast 作类型向下的转换
***** 8.3.2 虚方法
***** 8.3.3 签名
**** 8.4 合成、继承和其他替代的方法
***** 8.4.1 在合成和继承之间取舍
***** 8.4.2 合成的问题
***** 8.4.3 继承的问题
***** 8.4.4 现实世界的其他问题
**** 8.5 对象的复制
***** 8.5.1 copy_data方法
***** 8.5.2 指定复制的目标
**** 8.6 抽象类和纯虚方法
**** 8.7 回调
***** 8.7.1 创建一个回调任务
***** 8.7.2 使用回调来注入干扰
***** 8.7.3 记分板简介
***** 8.7.4 与使用回调的记分板进行连接
***** 8.7.5 使用回调来调试事务处理器
**** 8.8 参数化的类
***** 8.8.1 一个简单的堆栈
***** 8.8.2 关于参数化类的建议
**** 8.9 结论

*** Chp9 功能覆盖率

*** TODO Chp10 高级接口
DEADLINE: <2016-09-02 周五>
- State "TODO"       from ""           [2016-08-07 周日 16:28]

*** TODO Chp11 完整的SystemVerilog测试平台
DEADLINE: <2016-09-02 周五>
- State "TODO"       from ""           [2016-08-07 周日 16:28]

*** Chp12 SystemVerilog与C语言的接口
**** 12.1 传递简单的数值
***** 12.1.1 传递整数和实数类型
最基本的数据类型 int ；双状态
#+BEGIN_SRC verilog
import "DPI-C" function int factorial(input int i);
program automatic test;
   initial begin
      for (int i = 1; i<=10; i++)
        $display("%0d! = %0d", i, factorial(i));
   end
endprogram : test
#+END_SRC
#+BEGIN_SRC c
int factorial (int i)
{
  if (i <= 1) return 1;
  else return i * factorial(i-1);
}
#+END_SRC
***** 12.1.2 导入（import）声明
- 冲突命名，别名
  #+BEGIN_SRC verilog
    import "DPI-C" function \expect  = function fexpect();
  #+END_SRC
加反斜杠
***** 12.1.3 参数方向
- input, output, inout,
- ref 不支持
- 支持返回值
- 建议当不需要修改输入值时，将输入修饰为 const

attention ： 直接输入时钟是不可行的，因为input不可以为ref。思路：导入封装了时钟的task。
***** 12.1.4 参数类型
***** 12.1.5 导入数学库函数
c语言自带数学函数可以直接使用不需要进行封装
**** 12.2 连接简单的C子程序
***** 12.2.1 使用静态变量的计数器
在c语言中使用静态变量，多次调用时可以保持其值。
#+BEGIN_SRC c
static unsigned char count = 0;
#+END_SRC
***** 12.2.2 chandle 数据类型
#+BEGIN_SRC verilog
#include <svdpi.v>
#include <malloc.h> //分配内存空间
#include <veriuser.h> // pli接口io_printf
void* counter7_new(){
c7* c=(c7*)malloc(sizeof(c7));
c->cnt=0;
return c;
}

#+END_SRC
***** 12.2.3 值的压缩（packed）
"DPI-C" 说明使用packed的表示方式。
sv可能不会屏蔽dpi函数后未使用的位。
可以使用 SV_PACKED_DATA_NELEMS 实现bit和word之间的转换
指针 (x->aval)
***** 12.2.4 四状态数值
svLogic ： a & 0x2
svLogicVecVal* i : i->bval
***** 12.2.5 从双状态数值转换到四状态数值
sv侧， 使用logic和integer
c侧， 使用svLogicVecVal
**** 12.3 调用C++程序
***** 12.3.1 C++中的计数器
***** 12.3.2 静态方法
***** 12.3.3 和事务级（transaction level）C++模型通信
**** 12.4 共享简单数组
***** 12.4.1 一维数组--双状态
***** 12.4.2 一维数组--四状态
**** 12.5 开放数组（open array）
***** 12.5.1 基本的开放数组
***** 12.5.2 开放数组的方法
***** 12.5.3 传递大小未定的开放数组
***** 12.5.4 DPI中压缩（packed）的开放数组
**** 12.6 共享复合类型
***** 12.6.1 在sv和c间传递结构
***** 12.6.2 在sv和c间传递字符串
**** 12.7 纯导入方法和关联导入方法
**** 12.8 在C中与sv通信
***** 12.8.1 一个简单的导出方法
***** 12.8.2 调用SV函数的c函数
***** 12.8.3 调用sv任务的c任务
***** 12.8.4 调用对象中的方法
***** 12.8.5 上下文（context）的含义
***** 12.8.6 设置导入函数的作用域
**** 12.9 与其他语言交互
