collection/olddays/org/learnSV/learnSV.tex

循环中应当避免使用trigger，因为可能产生零延时循环，死锁。

\item 7.4.4 传递事件
\label{sec:orgd9a9839}

传递事件时，传递的是其指针。因此可以直接传递。

\item 7.4.5 等待多个事件
\label{sec:org96c3ac4}

\begin{itemize}
\item wait fork
\item 记录下已触发时间的数目
\begin{enumerate}
\item 在program中声明次数变量
\item 在生成类中使用静态变量。
\end{enumerate}
\end{itemize}
\end{itemize}


\item 7.5 旗语
\label{sec:orgf154e2e}

使用旗语可以实现对同一资源的访问控制。令牌，钥匙。

\begin{itemize}
\item 7.5.1 旗语的操作
\label{sec:org002c710}
new 创建一个或多个钥匙的旗语
get 获取一个或多个钥匙
put 返回一个或多个钥匙
try\(_{\text{get}}\) 试图获得钥匙而希望不被阻塞

\item 7.5.2 带多个钥匙的旗语
\label{sec:org5d3922f}

\begin{enumerate}
\item 返货的要是可以比取出来的多
\item 获取和返回多个钥匙需要谨慎。
在多个钥匙的环境中，如果只剩一把钥匙，而去请求2把钥匙，将的阻塞，此时若果有1把钥匙的请求，则成功。
此例忽略的 fifo 的原则。
\end{enumerate}
\end{itemize}

\item 7.6 信箱
\label{sec:orgba5ccac}

\begin{enumerate}
\item 假设发生器 generator 和驱动器 driver 都是自动的对象。其上下游的数据需要进行交互时，使用共享的数组或者队列的话，读写和阻塞会变得困难。

\item 信箱是有源端和收端的fifo。

\item 信箱是一个对象。需要使用new来例化。可选参数size，默认为0.
\begin{itemize}
\item put 把数据放入信箱中
\item get 把数据从信箱中取出。
\item peek 可以获取信箱中的拷贝，而不移除数据。
\item 信箱满，则put会阻塞，信箱空，则get会阻塞。
\item try\(_{\text{get}}\)()和try\(_{\text{peek}}\)() 不会发生阻塞。
\end{itemize}

\item 信箱中的数据可以是单个值，特别的，可以是句柄，但不能是对象。
\begin{itemize}
\item 传输对象时需要，新建对象，才能将对象的指针传输到信箱中，否则传输的是同一个对象。
\end{itemize}
\end{enumerate}

\begin{itemize}
\item 7.6.1 测试平台里的信箱
\label{sec:orgf1126f7}

\begin{itemize}
\item 使用 new 新建传输对象
\item 使用 put 传输对象
\item 使用 get 获得对象
\end{itemize}
\begin{verbatim}
// instance
 mailbox mbx;
 mbx = new();

// get class
 this.mbx = mbx;

\end{verbatim}

\item 7.6.2 定容信箱
\label{sec:orgf936a87}

\begin{itemize}
\item 缺省信箱容量为0，无限大
\item 大于0为信箱容量
\end{itemize}
\begin{verbatim}
mbx = new(1);
\end{verbatim}
\begin{itemize}
\item 当信箱存满时，put会阻塞。
\end{itemize}

\item 7.6.3 在异步线程间使用信箱通信
\label{sec:org0bbd370}

\begin{itemize}
\item 实际异步线程中，生产不应当在消费房的前头。
\item 没有握手信号，非定容信箱生产与消费将会不同步。
\end{itemize}

\item 7.6.4 使用定容信箱和探视(peek)来实现线程的同步
\label{sec:org97c83a0}

\begin{itemize}
\item 先使用peek拷贝数据，处理完成后，再使用get消除信箱中的数据。
\end{itemize}

\item 7.6.5 使用信箱和事件来实现线程的同步
\label{sec:orgcbaaa25}

\begin{itemize}
\item 同一个时间(time slot)内，只要促发过时间，则event.triggered为高，时间点(time slot)推进后，event.triggered变为0.
\item @ event，则只有在触发边沿才会被捕捉到，当同一个时间点(time slot)多次触发时，可以被多次捕捉。如果阻塞和促发同时发生，可能会出现次序的问题。
\end{itemize}

\item 7.6.6 使用信箱来实现线程的同步
\label{sec:org637ea38}

\begin{itemize}
\item 可以用一个mailbox来实现握手。无任何毒副作用。
\item 使用 mailbox 需要注意数据类型匹配！
\item 特例：
\begin{verbatim}
mailbox rtn;
rtn = new();
int i;
int j;
rtn.put(-i);  // attention
rtn.get(j);   // in ncsim, there is an error, for mismatch data type.
\end{verbatim}
\begin{verbatim}
integer j; // solution 1
\end{verbatim}
\begin{verbatim}
rtn.put(int ' (-i)); // solution 2
\end{verbatim}
\end{itemize}

\item 7.6.7 其他同步技术
\label{sec:org132df2c}
使用旗语也可以实现阻塞线程，旗语相当于第二个信箱，但是没有信息交互。
\end{itemize}

\item 7.7 构筑带线程并可实现线程间通信的测试程序
\label{sec:org4335434}

\begin{itemize}
\item 7.7.1 基本的事务处理器
\label{sec:org80fbac4}

\item 7.7.2 配置类
\label{sec:org5d91dfc}

\item 7.7.3 环境类
\label{sec:org4ce21ee}

\item 7.7.4 测试程序
\label{sec:orgdc9b408}
\end{itemize}
\end{itemize}

\subsection*{Part 3}
\label{sec:org3d05359}
\subsubsection*{Chp8 面向对象编程的高级技巧}
\label{sec:org64a1f02}
\begin{itemize}
\item 8.1 继承的简介
\label{sec:org2de5ed9}
\begin{itemize}
\item 8.1.1 事务基类
\label{sec:org17a3b9b}
\item 8.1.2 Transaction类的扩展
\label{sec:orgf7ced23}
\item 8.1.3 更多的oop术语
\label{sec:org84f6689}
\item 8.1.4 扩展类的构造函数
\label{sec:orgc8f82b7}
\item 8.1.5 驱动类
\label{sec:org1e74b6f}
\item 8.1.6 简单的发生器类
\label{sec:org374587e}
\end{itemize}
\item 8.2 蓝图(blueprint)模式
\label{sec:orgb56c6ff}
\begin{itemize}
\item 8.2.1 environment类
\label{sec:orgff5fc21}
\item 8.2.2 一个简单的测试平台
\label{sec:org39eb624}
\item 8.2.3 使用扩展的Transaction类
\label{sec:org7aa60bf}
\item 8.2.4 使用扩展类改变随机约束
\label{sec:orgc89f258}
\end{itemize}
\item 8.3 类型向下转换(downcasting)和虚方法
\label{sec:org4bf6ab2}
\begin{itemize}
\item 8.3.1 使用 \$cast 作类型向下的转换
\label{sec:orgedc32a8}
\item 8.3.2 虚方法
\label{sec:org27739a6}
\item 8.3.3 签名
\label{sec:org335ea97}
\end{itemize}
\item 8.4 合成、继承和其他替代的方法
\label{sec:org9d41ed8}
\begin{itemize}
\item 8.4.1 在合成和继承之间取舍
\label{sec:org7e30a07}
\item 8.4.2 合成的问题
\label{sec:org9833335}
\item 8.4.3 继承的问题
\label{sec:org29aaad5}
\item 8.4.4 现实世界的其他问题
\label{sec:orgf435da1}
\end{itemize}
\item 8.5 对象的复制
\label{sec:org9545f99}
\begin{itemize}
\item 8.5.1 copy\(_{\text{data方法}}\)
\label{sec:orgdd2370c}
\item 8.5.2 指定复制的目标
\label{sec:org76c5ce6}
\end{itemize}
\item 8.6 抽象类和纯虚方法
\label{sec:org0b70a89}
\item 8.7 回调
\label{sec:orge7c4e88}
\begin{itemize}
\item 8.7.1 创建一个回调任务
\label{sec:org7e03523}
\item 8.7.2 使用回调来注入干扰
\label{sec:orge433f38}
\item 8.7.3 记分板简介
\label{sec:org8fed096}
\item 8.7.4 与使用回调的记分板进行连接
\label{sec:org76c6a1e}
\item 8.7.5 使用回调来调试事务处理器
\label{sec:org73a297a}
\end{itemize}
\item 8.8 参数化的类
\label{sec:org8640725}
\begin{itemize}
\item 8.8.1 一个简单的堆栈
\label{sec:org1ea7359}
\item 8.8.2 关于参数化类的建议
\label{sec:orge122d7a}
\end{itemize}
\item 8.9 结论
\label{sec:org0b98958}
\end{itemize}

\subsubsection*{Chp9 功能覆盖率}
\label{sec:org08017f5}

\subsubsection*{{\bfseries\sffamily TODO} Chp10 高级接口}
\label{sec:org6a5c0f6}
\begin{itemize}
\item State "TODO"       from ""           \textit{[2016-08-07 周日 16:28]}
\end{itemize}

\subsubsection*{{\bfseries\sffamily TODO} Chp11 完整的SystemVerilog测试平台}
\label{sec:orgc6dcada}
\begin{itemize}
\item State "TODO"       from ""           \textit{[2016-08-07 周日 16:28]}
\end{itemize}

\subsubsection*{Chp12 SystemVerilog与C语言的接口}
\label{sec:orgcf3fad5}
\begin{itemize}
\item 12.1 传递简单的数值
\label{sec:org88ec49d}
\begin{itemize}
\item 12.1.1 传递整数和实数类型
\label{sec:orgfd09109}
最基本的数据类型 int ；双状态
\begin{verbatim}
import "DPI-C" function int factorial(input int i);
program automatic test;
   initial begin
      for (int i = 1; i<=10; i++)
        $display("%0d! = %0d", i, factorial(i));
   end
endprogram : test
\end{verbatim}
\begin{verbatim}
int factorial (int i)
{
  if (i <= 1) return 1;
  else return i * factorial(i-1);
}
\end{verbatim}
\item 12.1.2 导入（import）声明
\label{sec:orged1e757}
\begin{itemize}
\item 冲突命名，别名
\begin{verbatim}
import "DPI-C" function \expect  = function fexpect();
\end{verbatim}
\end{itemize}
加反斜杠
\item 12.1.3 参数方向
\label{sec:orgae5d9f7}
\begin{itemize}
\item input, output, inout,
\item ref 不支持
\item 支持返回值
\item 建议当不需要修改输入值时，将输入修饰为 const
\end{itemize}

attention ： 直接输入时钟是不可行的，因为input不可以为ref。思路：导入封装了时钟的task。
\item 12.1.4 参数类型
\label{sec:orge00eb13}
\item 12.1.5 导入数学库函数
\label{sec:org749df26}
c语言自带数学函数可以直接使用不需要进行封装
\end{itemize}
\item 12.2 连接简单的C子程序
\label{sec:org941abbb}
\begin{itemize}
\item 12.2.1 使用静态变量的计数器
\label{sec:org663192b}
在c语言中使用静态变量，多次调用时可以保持其值。
\begin{verbatim}
static unsigned char count = 0;
\end{verbatim}
\item 12.2.2 chandle 数据类型
\label{sec:org911de20}
\begin{verbatim}
#include <svdpi.v>
#include <malloc.h> //分配内存空间
#include <veriuser.h> // pli接口io_printf
void* counter7_new(){
c7* c=(c7*)malloc(sizeof(c7));
c->cnt=0;
return c;
}

\end{verbatim}
\item 12.2.3 值的压缩（packed）
\label{sec:org8d7c38c}
"DPI-C" 说明使用packed的表示方式。
sv可能不会屏蔽dpi函数后未使用的位。
可以使用 SV\(_{\text{PACKED}}\)\(_{\text{DATA}}\)\(_{\text{NELEMS}}\) 实现bit和word之间的转换
指针 (x->aval)
\item 12.2.4 四状态数值
\label{sec:org4f304df}
svLogic ： a \& 0x2
svLogicVecVal* i : i->bval
\item 12.2.5 从双状态数值转换到四状态数值
\label{sec:org9ee67cd}
sv侧， 使用logic和integer
c侧， 使用svLogicVecVal
\end{itemize}
\item 12.3 调用C++程序
\label{sec:orga236713}
\begin{itemize}
\item 12.3.1 C++中的计数器
\label{sec:org142d2bd}
\item 12.3.2 静态方法
\label{sec:orgb8060f4}
\item 12.3.3 和事务级（transaction level）C++模型通信
\label{sec:org52f506b}
\end{itemize}
\item 12.4 共享简单数组
\label{sec:org2313f33}
\begin{itemize}
\item 12.4.1 一维数组--双状态
\label{sec:org79e308c}
\item 12.4.2 一维数组--四状态
\label{sec:org0034d57}
\end{itemize}
\item 12.5 开放数组（open array）
\label{sec:org5b9d60b}
\begin{itemize}
\item 12.5.1 基本的开放数组
\label{sec:orgce5f87d}
\item 12.5.2 开放数组的方法
\label{sec:org416a020}
\item 12.5.3 传递大小未定的开放数组
\label{sec:orgbdd4945}
\item 12.5.4 DPI中压缩（packed）的开放数组
\label{sec:org9f15a65}
\end{itemize}
\item 12.6 共享复合类型
\label{sec:org8d836e9}
\begin{itemize}
\item 12.6.1 在sv和c间传递结构
\label{sec:orgb8de6e5}
\item 12.6.2 在sv和c间传递字符串
\label{sec:orgce09247}
\end{itemize}
\item 12.7 纯导入方法和关联导入方法
\label{sec:org3a7d3d5}
\item 12.8 在C中与sv通信
\label{sec:org85e034c}
\begin{itemize}
\item 12.8.1 一个简单的导出方法
\label{sec:org376bc48}
\item 12.8.2 调用SV函数的c函数
\label{sec:org313845b}
\item 12.8.3 调用sv任务的c任务
\label{sec:orgef1828a}
\item 12.8.4 调用对象中的方法
\label{sec:orge0b5c4a}
\item 12.8.5 上下文（context）的含义
\label{sec:org2d2b71c}
\item 12.8.6 设置导入函数的作用域
\label{sec:org4602d75}
\end{itemize}
\item 12.9 与其他语言交互
\label{sec:org8a57ff2}
\end{itemize}
Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
